/*
                                                     Redux
                                                   ‾‾‾‾‾‾‾‾‾
                   Це бібліотека для керування станом у JavaScript-додатках (найчастіше — у React)

 ОСНОВНА ІДЕЯ:

      ◦ Усі дані зберігаються в одному глобальному об’єкті (store)
      ◦ Зміни в store відбуваються через спеціальні дії (actions) та функції-редʼюсери (reducers - чисті функції)


 Чиста функція (pure function) — це функція, яка:

      ◦ Завжди повертає один і той самий результат для однакових вхідних даних
      ◦ Не має побічних ефектів — не змінює зовнішні змінні, DOM тощо
*/