                                                                                                                      /*
                                               Functional Components
                                             (Функціональні Компоненти)

 Функціональні компоненти існували з самого початку в React, але до версії 16.8 вони були обмежені — не мали доступу
 до стану (state) і життєвих циклів

 Починаючи з React 16.8, у функціональні компоненти були додані React Hooks, які дозволили їм:

     ◦ мати стан (useState)

     ◦ працювати з ефектами (useEffect)

     ◦ виконувати інші задачі, раніше доступні лише класам

 Після цього функціональні компоненти стали основним способом створення компонентів у React, а класові компоненти більше
 не розвиваються, хоча все ще підтримуються. React-команда офіційно не позначила класові компоненти як deprecated.


 Deprecated (застарілий) означає що функція, метод, технологія більше не рекомендується до використання, бо:

     ◦ з’явилася нова, краща альтернатива

     ◦ стара може бути видалена у майбутніх версіях

 Такі речі поки ще працюють, але використовувати їх не варто, особливо у новому коді




                                                                                                                      */