/*
                                                    React Router
                                                   ‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Це React бібліотека, яка дозволяє створювати маршрути (routes) в односторінковому застосунку (SPA)

 React Router під капотом працює завдяки об’єкту window.history, зокрема методу pushState()

 Цей метод дозволяє змінювати URL у браузері без перезавантаження сторінки (без додаткового get запиту на сервер),
 на відміну від звичайного переходу через <a href="...">, який викликає повне оновлення сторінки


 Принцип роботи React Router полягає в тому, щоб:

    1. Відстежувати зміну URL (endpoint) в адресному рядку браузера

    2. Визначати компонент, який відповідає цьому маршруту

    3. Підставляти його у DOM, не перезавантажуючи сторінку

 Це називається клієнтське маршрутизування (client-side routing) — коли маршрути обробляються на стороні клієнта, а не
 сервером


  React Router має два способи оголошення маршрутів (routes):

    1. Компонентний підхід (JSX)  —>  Малі та середні проєкти

    2. Обʼєктний підхід (Object-based routing)  —>  Великі проєкти, складні маршрути


 */