/*
                                                     Redux ToolKit
                                                   ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Boilerplate code — стартовий шаблон, це код, який повторюється завжди, коли ми починаємо проєкт
 Він потрібен, щоб налаштувати основу, але він не унікальний і не вирішує конкретні задачі програми

 ПРИКЛАД:  Redux (завжди треба створити store)  —>  це базовий каркас, без нього Redux не працюватиме

     import { configureStore } from '@reduxjs/toolkit';
     import todosReducer from './todosSlice';

     export const store = configureStore({
       reducer: {
         todos: todosReducer,
       },
     });


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Immer — це бібліотека, яка вбудована в Redux Toolkit для зручної роботи зі станом (state)

 У Redux стан є immutable (незмінним) — ми не можемо напряму змінювати об’єкт state


 Тому раніше, щоб оновити дані зі стану в редюсері, треба було:

     1. Створити копію стану вручну (за допомогою spread-оператора)

     2. Внести необхідні нам зміни в цю копію

     3. Й повернути цю копію як новий об'єкт стану


 До появи Immer (РУЧНА КОПІЯ):

       case: ADD_TOPIC:
          return {
            ...state,
            topics: [...state.todos, action.payload]
          };


 З Immer (АВТОМАТИЧНА КОПІЯ):

 Immer створює ілюзію прямої зміни об’єкта стану в редюсері, але насправді під капотом автоматично виконує за нас ті ж
 самі дії, які ми раніше виконували вручну:

     1. Створює копію стану

     2. Вносить задані зміни у цю копію

     3. Повертає новий об’єкт стану, який вже знову є immutable


       addTopic: (store, action) => {
           store.topics.push(action.payload)
       }


 ТОБТО БІБЛІОТЕКА IMMER АВТОМАТИЗУЄ СТВОРЕННЯ КОПІЇ ОБ’ЄКТА СТАНУ


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾


 СИНХРОННІ ДІЇ
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

     ◦ Redux і React за замовчуванням працюють СИНХРОННО

     ◦ Вони пропагують ідею передбачуваних дій: нічого далі не спрацює поки не виконається попередня дія

     ◦ Вони не мають автоматичної підтримки асинхронності — все, що асинхронне, потрібно обробляти окремо
       (через useEffect у React або за допомогою додаткової middleware як Redux Thunk у Redux)

*/