                                                                                                                      /*
                                                  МЕМОІЗАЦІЯ
                                                ‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 Мемоізація — це техніка оптимізації, яка запам’ятовує результат функції тим самим уникаючи повторних обчислень при тих
 самих вхідних даних (аргументах)

 Якщо функція вже обчислювала результат для конкретних аргументів — вона не буде рахувати знову, а просто поверне
 збережене значення

              БЕЗ МЕМОІЗАЦІЇ:

function sum(a, b) {
  console.log(`Calculating... → ${a + b}`);
  return a + b
}

sum(2, 3);  // Calculating... → 5
sum(2, 3);  // Calculating... → 5 (знову рахує)



               З МЕМОІЗАЦІЄЮ:

const cache = {};

function sum(a, b) {
  const key = `${a}, ${b}`;

  if (cache[key]) {                            —>  якщо результат вже був обчислений — повертається збережене значення
    console.log(`Cache: ${cache[key]}`);
    return cache[key];
  }

  const result = a + b;                        —>  якщо таких аргументів ще не було — функція виконується
  cache[key] = result;                         —>  й результат кешується

  console.log(`Calculating... → ${result}`);
  return result;
}

sum(2, 3);  // Calculating... → 5
sum(2, 3);  // Cache: 5
sum(4, 4)   // Calculating... → 8


 Зазвичай мемоізацію використовують для важких обчислень (алгоритмічних функцій). Тобто функцій, які виконують складну
 або тривалу логіку, наприклад: фільтрація, сортування.



                                          МЕМОІЗАЦІЯ В REACT:
                                        ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 У React мемоізація використовується, щоб уникнути зайвих обчислень, перерендерів і викликів функцій


 1. React.memo() — це higher-order component у React, який МЕМОІЗУЄ КОМПОНЕНТ                  —>   <RegularComponent />
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
     ЩО РОБИТЬ: не перерендерює компонент, якщо його props не змінилися

     ВИКОРИСТАННЯ:
         ◦ У React.memo() зазвичай обгортають статичні компоненти — тобто такі, у яких пропси змінюються дуже рідко або
           взагалі не залежать від пропсів

           НАПРИКЛАД:
               — Header
               — Footer
               — Бокове меню

     ЯК ПРАЦЮЄ:
         ◦ Коли батьківський компонент оновлюється, React перевіряє пропси мемоізованого компонента

         ◦ Якщо пропси не змінилися, повторний рендер не відбувається

         ◦ Якщо хоча б один проп змінився — компонент буде перерендерено


     ВАЖЛИВО: Не варто застосовувати React.memo:
                • до дрібних компонентів із простим рендером
                • або для компонентів, пропси яких змінюються часто
                                 ↓
              У таких випадках витрати на перевірку пропсів можуть бути більшими, ніж вигода від уникнення ререндерів



 2. useMemo() — хук, який МЕМОІЗУЄ РЕЗУЛЬТАТ ОБЧИСЛЕННЯ — ЗНАЧЕННЯ                           —>   <ExpensiveComponent />
‾‾‾‾‾‾‾‾‾‾‾‾‾

     Дозволяє мемоізувати результат обчисленя повільної або складної операції між рендерами
     Він запам'ятовує значення, обчислене функцією і повторно його використовує якщо залежності не змінилися


     useMemo(() => { ... }, [count])  —→  useMemo — це хук, який приймає два аргументи:

          АРГУМЕНТ 1: () => { return slowFunction(count) }

               – Це функція, яка повертає результат виконання повільної або складної операції
               – Вона повертає значення, яке потрібно запам’ятати (мемоізувати)
               – React буде викликати цю функцію тільки якщо залежності змінились

          АРГУМЕНТ 2: [count]

               – Це масив залежностей
               – Якщо count не змінився з попереднього рендера → функція не виконується
               – Якщо count змінився → React виконає функцію знову і оновить memoizedResult



     ЯК ПРАЦЮЄ REACT ПРИ КОЖНОМУ РЕНДЕРІ:

        Крок	         Що перевіряється	                                  Дія
      ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
         1	    Чи змінився count у [count]?	           Якщо ні → повертає старий memoizedResult
         2	    Якщо так, викликає slowFunction(count)	   Зберігає новий результат у memoizedResult


     ПІДСУМОК
         ◦ useMemo виконує функцію, передану першим аргументом, лише коли змінився count

         ◦ Зберігає результат у memoizedResult

         ◦ Уникає повторного виконання повільної або складної операції


     ЩО РОБИТЬ:
         ◦ запам’ятовує результат обчислення функції
         ◦ і повертає закешоване значення, допоки залежності не змінились


      ЯК ПРАЦЮЄ:

         ◦ useMemo приймає функцію з дорогою операцією і масив залежностей

         ◦ Він запускає цю функцію тільки тоді, коли змінюється залежність

         ◦ Якщо залежності не змінилися, useMemo повертає збережене раніше значення без повторних обчислень

         ТОБТО:
                ◦ При ререндері компонента, якщо залежності ті самі — результат не перестворюється

                ◦ Якщо хоча б одна залежність змінилася — функція виконується заново, і результат оновлюється


      ВИКОРИСТАННЯ:
         ◦ У useMemo() зазвичай обгортають:

              • Масивні обчислення:
                    ◦ фільтрацію або сортування великих масивів (filter, map, sort)
                    ◦ повільні або складні функції, які витрачають багато ресурсів      —>   <ExpensiveComponent />

              • Пропси reference type, які будуть викликати непотрібні ререндери, якщо не мемоізувати


      ВАЖЛИВО:
         ◦ useMemo() повертає результат обчислень, а не саму функцію (навідміну від useCallback, який мемоізує функцію)


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                        ЧЕРЕЗ useMemo() НАЙЧАСТІШЕ МЕМОІЗУЮТЬ:

 1. МАСИВНІ ОБЧИСЛЕННЯ (всередині компонентів):

      1.1  ФІЛЬТРАЦІЮ:

           const activeUsers = useMemo(() => {
              return users.filter(user => user.isActive)
           }, [users])

               ↓
           useMemo() виконує фільтрацію лише якщо зміниться users, інакше повертає кешоване значення


      1.2  СОРТУВАННЯ:

           const sortedUsers = useMemo(() => {
              return [...users].sort((a, b) => a.username.localeCompare(b.username))
           }, [users])

                            ————————————————————————————————————————————————————————————————————————————————————————————
                                                                Метод sort()


                             ◦ Мутує оригінальний масив — навідміну від filter() і map(), які повертають новий

                                  ТОМУ:
                                       • Спочатку створюємо копію оригінального масиву (через rest operator),
                                         щоб не мутувати його  —>  [...users]

                                       • І потім вже на ньому викликаємо метод sort()


                             ◦ Приймає колбек-функцію порівняння:  (a, b) => a.username.localeCompare(b.username)

                                  У НІЙ:
                                       • (a, b) — це два елементи з масиву, які потрібно порівняти

                                       • a.username і b.username — імена користувачів, які треба порівняти

                                       • localeCompare() — метод сортування за алфавітом, який повертає:

                                                       Результат         	                 Що означає
                                                 ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                                 -1 або будь-яке число < 0   →   a.username передує b.username (a < b)
                                                            0                →   a.username дорівнює b.username (a = b)
                                                  1 або будь-яке число > 0   →   a.username йде після b.username (a > b)
                            ————————————————————————————————————————————————————————————————————————————————————————————

 3. ПРОПСИ REFERENCE-TYPE

  ПРОБЛЕМА:

      Reference-type пропси (об'єкти, масиви, функції) при кожному рендері створюються з новою reference, навіть якщо
      їх вміст не змінюється

      ТОБТО, якщо передати такий пропс у дочірній компонент — він щоразу отримуватиме нове значення (!== prevProps),
      незалежно від вмісту

      Це спричиняє непотрібний ререндер дочірнього компонента, навіть якщо той огорнутий у React.memo, бо React.memo
      робить лише поверхневу перевірку (===)

      ❗ВАЖЛИВО: Немає сенсу мемоізувати пропси через useMemo, якщо дочірній компонент НЕ огорнутий у React.memo


                (1)         (2)
    РІШЕННЯ:  useMemo() + React.memo

      (1) Мемоізувати reference-type пропси у батьківському компоненті:

           ❗ об'єкти та масиви  —>  через useMemo
           ❗ функції  —>  через useCallback

      (2) Огорнути дочірній компонент у React.memo, щоб уникнути зайвих ререндерів при незмінних пропсах


       PARENT COMPONENT
—————————————————————————————

import { useMemo } from 'react'

import { ChildComponent } from './ChildComponent'


export default function ParentComponent({ users, posts }) {

  const activeUsers = useMemo(() => {              —>  Мемоізуємо фільтрація великого масиву через useMemo
    return users.filter(user => user.isActive)
  }, [users])                                      —>  useMemo тепер виконується лише при зміні пропса users


  Якщо оновлюється пропс posts, але users не змінюється  —>  activeUsers не перестворюється, бо useMemo не викликається

  └─>  В РЕЗУЛЬТАТІ: завдяки useMemo() + React.memo  —>  ChildComponent не ререндериться, якщо масив users не змінився


  return (
   <ChildComponent activeUsers={activeUsers} />
  )
}


       CHILD COMPONENT
—————————————————————————————

import { memo } from 'react'


function ChildComponent({ activeUsers }) {

  console.log('ChildComponent rendered')

  return (
    <ul>
      {activeUsers.map(user => (
        <li key={user.id}>{user.name}</li>
      ))}
    </ul>
  )
}

 export default memo(ChildComponent)  // Мемоізація компонента


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾


 3. useCallback() — хук, який МЕМОІЗУЄ ФУНКЦІЮ
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

     ЩО РОБИТЬ: повертає ту саму функцію між рендерами, якщо залежності не змінились

     КОЛИ ВИКОРИСТОВУВАТИ:

         ◦ Коли передаєш функцію як пропс у дочірній компонент (useCallback з порожнім масивом залежностей)

              МЕТА: Щоб дочірній компонент не перерендерювався даремно через нове посилання на функцію щоразу

              const memoizedFn = useCallback(() => {
                setCount(prev = prev + 1)
              }, [])

                 ↓
              Функція ініціалізується один раз при першому рендері і більше не перестворюється при наступних, бо список
              залежностей порожній


             ❗useCallback(fn, []) — функція ніколи не перествориться

             ❗useCallback(fn, [x]) — функція перествориться тільки якщо dependency (x) зміниться


────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                    React.memo() — мемоізує компоннет
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                    useMemo() — мемоізує значення (результат обчислень)
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                    useCallback() — мемоізує функцію (її посилання)
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────


                                                  CONTEXT API
                                                ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 API — це скорочення від Application Programming Interface   тобто інтерфейс для програмного використання

 У випадку Context API, мається на увазі, що React надає набір інструментів (інтерфейс), за допомогою яких ми можемо:

     ◦ Створити контекст: const MyContext = React.createContext()

     ◦ Огорнути компонент у Provider: <MyContext.Provider value={...}>

     ◦ Отримати значення через useContext(MyContext)

‾‾‾‾‾‾‾‾‾‾‾

 Props — це властивості, які передаються як атрибути від батьківського компонента до дочірніх

 ПРОБЛЕМА:
   Props drilling — це ситуація, коли батьківський компонент передає дані (props) через кілька рівнів компонентів,
   навіть якщо проміжні компоненти не використовують ці дані, а лише передають далі

 РІШЕННЯ

   1. Context API
   ‾‾‾‾‾‾‾‾‾‾‾‾‾‾
   2. Використовувати глобальний менеджер стану — Redux. Він дозволяє надавати доступ до даних будь-якому компоненту
   напряму, без необхідності передавати їх через проміжні компоненти

                                                   ↓ ↓ ↓

 React Context — це механізм React, який дозволяє передавати дані (функції, об'єкти, значення) глибоко в дерево
 компонентів без необхідності передавати їх через props на кожному рівні


 В Context можна огорнути або весь додаток <App />, або необхідні підкомпоненти (наприклад, одну сторінку):

     1. Ми огортаємо наш додаток у спеціальний контекстний компонент (наприклад, <TodosContext.Provider>), який дає нам
        доступ до контексту

     2. Усі дочірні компоненти, що знаходяться всередині цього провайдера, можуть у будь-який момент під'єднатись до
        контексту й отримати необхідні дані


 ТОБТО Context — це звичайна огортка над багатьма компонентами, яка дозволяє ділитися даними з цими компонентами
 одночасно, без потреби передавати їх вручну на кожному рівні

 Context використовується в невеликих додатках, бо додає багато додаткової й часом складної логіки. Для великих
 додатків обирають Redux

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

                   Without Context API                                  With Context API

               ┌─────────────────────┐                               ┌────────────────────┐
               │        state        │                               │   context.value    │
               └──────────┬──────────┘                               └──────────┬─────────┘
                          │ props                                               │ provider
               ┌──────────▼──────────┐                      ┌───────────────────▼──────────────────┐
               │      props.state    │                      │                 value                │
               └─┬─────────────────┬─┘                      │        ┌────────────────────┐        │
                 │ props           │ props                  │        │                    │        │
           ┌─────▼───────┐  ┌──────▼──────┐                 │        └────────────────────┘        │
           │ props.state │  │ props.state │                 │   ┌─────────────┐  ┌─────────────┐   │
           └─────────────┘  └─────────────┘                 │   │    value    │  │    value    │   │
                                                            │   └─────────────┘  └─────────────┘   │
                                                            └──────────────────────────────────────┘

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────




                                                                                                                      */