import express from 'express';   // імпортуємо функцію express з бібліотеки Express
const router = express.Router(); // створюємо новий екземпляр роутера (router) — об’єкт для групи маршрутів
import fs from 'fs';


router.get('/', (req, res) => { // створюємо route
    const db = JSON.parse(fs.readFileSync('db.json', 'utf-8')); // синхронно читаємо файл db.json й парсимо у JS-об'єкт
    res.json(db.destinations); // відправляємо клієнту потрібну частину (destinations) в форматі JSON

});

export default router; // експортуємо router, щоб під’єднати його до додатку під конкретним шляхом (endpoint


/*——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

 express.Router() — конструктор у Express, який створює новий екземпляр роутера (router) — це об’єкт, який має ті самі
 методи, що й app (get, post, use тощо)

 За допомогою router ми можемо створювати маршрути (routes), які відносяться до однієї коллекції ресурсів
 (наприклад /destinations)

 ТОБТО express.Router() ДОЗВОЛЯЄ РОЗБИВАТИ МАРШРУТИ (ROUTES) НА ОКРЕМІ МОДУЛІ ДЛЯ КОНКРЕТНОЇ КОЛЕКЦІЇ РЕСУРСІВ


 КРОКИ:

   1. Створюємо маршрути (routes) через router для конкретної коллекції ресурсів (endpoints), наприклад /destinations

   2. Пишемо ці маршрути в окремому файлі і додаємо потрібні обробники (get, post, тощо)

   3. Потім підключаємо цей router до головного додатку через app.use('/destinations', router)

————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

 Файли JSON за замовчуванням неможливо імпортувати через import у Node.js, бо без спеціальних налаштувань Node.js не
 підтримує імпорт JSON-файлів

 Щоб працювати з JSON-файлами на сервері, зазвичай використовують модуль fs


 fs (File System) — вбудований модуль Node.js

     ◦ Це означає що модуль встановлюється разом із Node.js, він є частиною самого Node.js, і для його використання не
       треба нічого додатково встановлювати через npm

     ◦ Модуль — це окрема частина коду, яка реалізує певну функціональність і може бути використана в інших файлах


 fs (File System) модуль використовується для роботи з файлами в будь-якому форматі (JSON, txt, тощо)
 Але на практиці в Node.js його часто використовують саме для JSON


                                      Найпопулярніші Методи File System (fs)
                                     ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 1. fs.readFileSync(path, encoding) — читає файл синхронно (блокує код, поки не дочитає)
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
     ◦ path — шлях до файлу, який ми хочемо прочитати

     ◦ encoding — у якому фрматі читати файл (рядок, байти тощо)  —> 'utf-8', читати як звичайний текст

   ПРИКЛАД:

     │ import fs from 'fs';
     │
     │ const data = fs.readFileSync('db.json', 'utf-8')  // читаємо файл db.json як текст
     │
     │ const db = JSON.parse(data)  // перетворюємо JSON у об’єкт JS
     │ console.log(db);



 2. fs.readFile(path, encoding, callback) — читає файл асинхронно (не блокує виконання коду)
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
     ◦ path — шлях до файлу, який ми хочемо прочитати

     ◦ encoding — у якому форматі читати файл ('utf-8', читати як звичайний текст)

     ◦ callback — функція, яка викликається після того, як файл прочитано. Вона завжди приймає два параметри:

          ◦ err — помилка (якщо виникла, інакше null)

          ◦ data — вміст файлу (якщо прочитано успішно)


   ПРИКЛАД:

     │ import fs from 'fs';
     │
     │ fs.readFile('db.json', 'utf-8', (err, data) => {
     │   if (err) {
     │     console.error('Помилка читання файлу:', err);
     │     return;
     │   }
     │
     │   const db = JSON.parse(data); // перетворюємо JSON у об’єкт JS
     │   console.log(db);
     │ });
     │
     │ console.log('Цей код виконається РАНІШЕ, ніж прочитається файл');



 3. fs.writeFileSync(path, data, encoding) — записує у файл синхронно
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
     ◦ path — шлях до файлу

     ◦ data — що саме записати (рядок, JSON, тощо)

     ◦ encoding — у якому форматі зберегти дані у файл ('utf-8', зберегти як звичайний текст)


   ПРИКЛАД:

     │ import fs from 'fs'
     │
     │ const newData = { destinations: ["Lviv", "Kyiv", "Odesa"] };
     │
     │ const jsonString = JSON.stringify(newData, null, 2);
     │
     │ fs.writeFileSync('db.json', jsonString, 'utf-8');
     │
     │ console.log("Файл успішно оновлено!");


         JSON.stringify(value, replacer, space);

            ◦ value — що саме перетворюємо (newData)

            ◦ replacer — можна вибірково вказати, які властивості включати у результат (null значить всі)

               │ const user = { name: 'Anna', age: 22, city: 'Kyiv' };
               │
               │ console.log(JSON.stringify(user, ['name', 'city'], 2));     —> { "name": "Anna", "city": "Kyiv" }

            ◦ space — відступи для красивого форматування JSON
                                                                                                                      */
