import { createContext, useState, useEffect } from 'react'    // (1)  —>  Імпортуємо функцію, яка створює контекст

export const ThemeContext = createContext(null);       // (2) створюємо контекст (в дужках передаємо початкове значення контексту)


export default function ThemeProvider({ children }) {
    const [theme, setTheme] = useState('light');

    useEffect(() => {
        document.documentElement.className = `mode-${theme}`;
    }, [theme]);

    const toggleTheme =
        () => setTheme(prevTheme => prevTheme === 'light' ? 'dark' : 'light');

    const contextValue = {
        theme,
        toggleTheme,
    }

    return (
        <ThemeContext.Provider value={contextValue}>
            {children}
        </ThemeContext.Provider>
    )
}


/*——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————


 ThemeProvider() — це користувацький компонент, тобто компонент, який ми самі створюємо як зручну обгортку над
 контекстною логікою

 Саме в ньому відбувається ІНКАПСУЛЯЦІЯ ЛОГІКИ КОНТЕКСТУ, А САМЕ:

     1. Створення внутрішнього стану  —>  theme

           const [theme, setTheme] = useState('light');


     2. Написання функцій для зміни цього стану  —>  toggleTheme

           const toggleTheme =
             () => setTheme(prevTheme => prevTheme === 'light' ? 'dark' : 'light');


     3. Формування об’єкта контексту  —>  contextValue

           const contextValue = {
             theme,
             toggleTheme,
           }

           Об’єкт контексту — це звичайний JS-об'єкт, який ми заповнюємо даними, які хочемо зробити доступними для
           всіх дочірніх компонентів (дані, які ми створили в першому та другому пункті)


     4. Передача об’єкта контексту в ThemeContext    —>   <ThemeContext.Provider value={contextValue}>

           ◦ Ми передаємо об’єкт contextValue у контекст, використовуючи пропс value провайдера <ThemeContext.Provider>

           ◦ Саме через цей проп ми заповнюємо контекст даними, які хочемо зробити доступними для всіх child components


     5. Огортання всіх дочірніх компонентів ({children}) у <ThemeContext.Provider>

           <ThemeContext.Provider value={contextValue}>
            {children}
           </ThemeContext.Provider>

           Таким чином ми створюємо для них покриття — зону, в якій ці компоненти можуть підключитися до контексту й
           отримати з нього дані



  ЦЕ І Є ІНКАПСУЛЯЦІЯ: Приховування внутрішньої реалізації та надання лише необхідного інтерфейсу

     —>  Вся логіка роботи з темою (theme, toggleTheme, створення об’єкта контексту, передача через Provider)
         знаходиться всередині цього компонента

     —>  Зовнішній код не потребує знати деталей — він просто використовує <ThemeProvider> як готове рішення,
         в яке просто можна огорнути компоненти

————————————————————————————————————————————————————————

 Користувацький компонент ThemeProvider() повертає JSX-розмітку, обгорнуту в КОНТЕКСТНИЙ КОМПОНЕНТ ThemeContext.Provider

 Це означає, що всередині JSX, який повертає ThemeProvider, знаходиться <ThemeContext.Provider>, який:

        1. Передає значення у контекст (ThemeContext) через пропс value

        2. Огортає дочірні компоненти (children) — тобто весь вміст, який був переданий між тегами
           <ThemeProvider>...</ThemeProvider>

  ТАКИМ ЧИНОМ, ці компоненти опиняються в ЗОНІ ДІЇ КОНТЕКСТУ й можуть використовувати хук useContext(ThemeContext),
  щоб отримувати дані з контексту

————————————————————————————————————————————————————————

 Компонент ThemeProvider() приймає як пропс { children }

     ◦ children — це спеціальний пропс, який автоматично передається React у компонент, якщо ми вкладаємо інші елементи
       всередину цього компонента

     ◦ ТОБТО JSX між <ThemeProvider> та </ThemeProvider> — це і є children


 ЗВІДКИ БЕРУТЬСЯ children:

     1. Ми огортаємо компоненти у ThemeProvider (компонент з контекстною логікою)

             <ThemeProvider>
               <App />
             </ThemeProvider>

     2. Увесь вміст між відкриваючим і закриваючим тегом ThemeProvider — це і є children  —>  <App />

     3. React автоматично передає цей вміст у спеціальний пропс children комопнента ThemeProvider:

             function ThemeProvider({ children }) {}    ———>    children = <App />


     4. Потім ми вставляємо children у JSX розмітку нашого провайдера

        Провайдер — це context component, який надає (provide) контекст дочірнім компонентам — <ThemeContext.Provider>

             return (
               <ThemeContext.Provider value={contextValue}>
                 {children}
               </ThemeContext.Provider>
             )


                           ЧОМУ МИ МАЄМО ВСТАВЛЯТИ ПРОПС children В НАШ ПРОВАЙДЕР:

    БО коли ми огортаємо <App /> у <ThemeProvider>, компонент <App /> НЕ має доступу до контексту автоматично

    ЧОМУ:

        ◦ Cам по собі компонент ThemeProvider — це просто створений нами компонент, він не надає контекст напряму

        ◦ Його задача — інкапсуювати контекстну логіку (налаштувати ThemeContext.Provider і передати йому value)
          Для React <ThemeProvider> — це просто обгортка

        ◦ Контекст же буде доступний лише тоді, коли компоненти будуть знаходяться всередині <ThemeContext.Provider>


    ТОМУ: вставляємо {children} у JSX провайдера

             return (
               <ThemeContext.Provider value={contextValue}>
                 {children}
               </ThemeContext.Provider>
             )

    ЩО ЦЕ ОЗНАЧАЄ:

        ◦ Ми беремо вміст між тегами <ThemeProvider>...</ThemeProvider>   —>   <App />

        ◦ І вставляємо його прямо в <ThemeContext.Provider>

        ◦ Отже: тепер <App /> фізично перебуває усередині провайдера, а не просто в ThemeProvider

    ТИМ САМИМ має доступ до контексту через провайдер, до якого вона може підключитися й отримати дані


————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
        Зазвичай children використовуються в спеціальних компонентах: контекстах (ThemeContext) або ErrorBoundary
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————


                                                  CONTEXT
                                                ‾‾‾‾‾‾‾‾‾‾‾
React Context має два стани:

   1. Provider — це той, хто надає значення  —>  ThemeContext.Provider

          ◦ Це компонент-обгортка, який огортає або весь додаток — <App />, або окрему частину (наприклад, сторінку)

          ◦ Він передає значення контексту (value) усім дочірнім компонентам

               Тобто всі компоненти всередині цього провайдера можуть отримати доступ до значення, яке він надає,
               без передачі через props


   2. Consumer — це той, хто отримує значення, тобто компонент, який підписується на контекст через хук useContext()


——————————————————————————————————————————————


 (1) createContext  —>  це функція, яка створює контекст — спільне середовище для зберігання даних, до яких можуть
     звертатися всі вкладені компоненти напряму

        ◦ Це середовище дозволяє уникати передавання даних через props на кожному рівні

        ◦ Компоненти, які хочуть читати ці дані, мають підписатися на контекст через useContext()


 (2) createContext(null)  —>  створюємо контекст (пусту шину передачі даних)

        ◦ Під "шиною" мається на увазі один загальний канал - місце зберігання даних, до якого можна під'єднатися й
          передати або отримати дані

        ◦ Порожня шина — означає, що коли ми викликаємо createContext(null) — ми просто створюмо канал, але ще не
          вказуємо, які саме дані по ньому передавати. ТОБТО:

              ◦ Контекст вже існує, він збережений в змінну ThemeContext - це об'єкт

              ◦ Але ніякого значення в ньому ще немає

                                                  ↓ ↓ ↓ ↓ ↓


 ThemeContext — це загальний канал (контекст) - місце зберігання даних, яке спочатку порожнє (null — не містить
 жодних даних)

 ThemeContext — це спеціальний об'єкт, який React створює за допомогою функції createContext()

         Цей об'єкт має таку структуру:

         {
           Provider: ...,     —>   компонент, який надає значення через prop value
           Consumer: ...,     —>   компонент, який отримує значення (застарілий спосіб)
         }

—————————————————

 Provider — це спеціальний React-компонент, який знаходиться всередині об'єкта, створеного за допомогою createContext()
 (ThemeContext.Provider)

       1. Ми використовуємо його в JSX-розмітці, огортаючи ним усі дочірні компоненти, яким хочемо надати доступ до
          контексту (ThemeContext)

       2. Звертаючись до компонента Provider з об'єкта ThemeContext через JSX-тег <ThemeContext.Provider> ми:

             2.1  підключаємося до створеного контексту (каналу)

             2.2  й передаємо туди дані (значення) через проп value  —>  заповнюємо контекст даними


                  ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾ ↓ ↓ ↓ ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                  1. Спочатку створюємо звичайний JavaScript об'єкт — contextValue

                  2. Заповнюємо цей об'єкт значеннями, до яких хочемо надати доступ дочірнім компонентам

                           const contextValue = {
                             theme,
                             toggleTheme,
                           }

                  3. Передаємо цей об'єкт в пропс value комонента <ThemeContext.Provider>

                  4. Усе це відбувається всередині компонента ThemeProvider, який ми створили самі.
                     Це наша власна компонента-обгортка, яка:

                          ◦ інкапсулює контекстну логіку

                          ◦ повертає JSX, обгорнутий у провайдер — <ThemeContext.Provider>

                  ——————————————————————————————————————————————————————————————————————————————————————————————————————

       3. Огортуючи всі дочірні компоненти в тег <ThemeContext.Provider>, ми створюємо для них покриття — тобто зону,
          в якій ці компоненти можуть підключитися до контексту й отримати з нього дані

       4. А вже самі дочірні компоненти вирішують, чи підключатися до цього контексту, викликаючи хук useContext()  —>
          useContext(ThemeContext)

—————————————————

      ПІДСУМОК:

         1. Контекст — це сховище (канал) — тобто місце зберігання даних, яке саме по собі нічого не транслює
            Воно створюється через createContext() і спочатку порожнє (null)

            До цього контексту (ThemeContext) можна:

              1.1  Під'єднатися через Provider  —>  й передати туди дані через проп value

              1.2  Під'єднатися через спеціальних хук useContext()  —>  й отримати ці дані


         2. Provider — це спеціальний компонент контексту, який виконує дві основні дії:

                <ThemeContext.Provider value={contextValue}>
                    {children}
                </ThemeContext.Provider>


              2.1  Підключається до створеного контексту й передає туди значення через пропс value (заповнює контекст)

              2.2  Огортає всі дочірні компоненти, створюючи для них покриття — зону, в якій ці компоненти можуть
                   підключитися до контексту й отримати з нього дані

         3. Тепер дочірні компоненти можуть підписатися на контекст й отримати значення, використовуючи хук useContext()

                const { theme, toggleTheme } = useContext(ThemeContext)


——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————*/