import express from 'express';

import { validateRequest } from '#shared/validation/index.js';
import { requireAuth } from './auth.middleware.js';
import { validateEmail, validateEmailAndCode } from './auth.validator.js';
import { sendCode, verifyCode, logout } from './auth.controller.js';

const router = express.Router();

router.post('/send-code', validateRequest(validateEmail), sendCode);

router.post('/verify-code', validateRequest(validateEmailAndCode), verifyCode);

router.post('/logout', requireAuth, logout);

export default router;



/*————————————————————————————————————————————  Передача даних у мережі  ———————————————————————————————————————————————

 Будь-які дані в інтернеті (текст, JSON, зображення) передаються у вигляді потоку байтів


 1. Сегментація (Розбиття на частини)
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 Дані не передаються одним великим шматком. Розмір пакету даних обмежений параметром MTU (Maximum Transmission Unit)

       ◦ MTU (Maximum Transmission Unit): Загальний ліміт одного пакета в мережі становить 1500 байтів

       ◦ MSS (Maximum Segment Size): Це чистий обсяг даних, який можна покласти в один сегмент
         Він становить 1460 байтів (1500 мінус 20 байтів на заголовок IP та 20 байтів на заголовок TCP)


       ◦ Якщо дані більші за 1460 байтів, TCP автоматично розрізає їх на декілька сегментів


                                             ———————————————————————————————————————————————————————————————————————————

                                                ◦ Чисті дані (MSS): 1460 байтів

                                                ◦ Сегмент (1480 байтів) — це чисті дані + заголовок TCP

                                                ◦ Пакет (1500 байтів) — це чисті дані + заголовок TCP + заголовок IP

                                             ———————————————————————————————————————————————————————————————————————————


 2. Порядок байтів у пакеті даних (Headers + Payload)
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

       ◦ Перші 20 байтів —> IP Header (Містить IP-адресу відправника та IP-адресу отримувача)

       ◦ Наступні 20 байтів —> TCP Header

             • Містить порти (на який "кабінет" сервера доставити дані — наприклад, 465 для пошти)

             • Містить Sequence & Acknowledgment Numbers (номери черговості), щоб зібрати розрізані шматки в правильному порядку.

             • Містить Flags (SYN, ACK, FIN) для керування станом з'єднання.


       ◦ Все інше —> Data Payload (Наш реальний контент (JSON, текст листа тощо))



—————————————————————————————————————————————  Анатомія IP header (IPv4)  ——————————————————————————————————————————————

 Кожен пакет починається з 20-байтового заголовка, який містить інструкції для маршрутизації (IP header).


                                          НАЙГОЛОВНІШІ ПОЛЯ IP ХЕДЕРА
                                          ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
——————
 1. Version (4 біти) — вказує на версію протоколу
——————
       ◦ Визначає, за якими правилами формувався хедер і як саме його зчитувати

       ◦ Існують дві основні версії (IPv4 та IPv6), які мають принципово різну структуру та логіку обробки

——————
 2. IHL (Internet Header Length — 4 біти) — довжина IP заголовка
——————
       ◦ 20 байтів — це мінімальний і стандартний розмір. Але протокол IPv4 дозволяє додавати додаткову інформацію

       ◦ Це поле вказує на точну довжину заголовка, щоб роутер знав, де закінчуються службові дані й починається
         payload, тобто сигмент (TCP header + payload)

——————
 3. Total Length (16 бітів) — повна довжина пакета
——————
       ◦ Теоретичний ліміт IPv4 — це 65 535 байтів

             • Цифра 65 535 — це максимальна цифра яку можна отримати з 16 бітів

             • Це означає, що протокол IPv4 чисто теоретично дозволяє створювати гігантський пакет який буже важити
               65 535 байтів

             • АЛЕ в реальному інтернеті ми такий пакет не зустрінемо

                                                                              ——————————————————————————————————————————
                                                                                1 біт (b) — найменша одиниця (0 або 1)

                                                                                1 байт (B) — 8b

                                                                                1 кілобайт (KB) — 1024B

                                                                                                  65 535 байтів ≈ 64KB
                                                                              ——————————————————————————————————————————

       ◦ Фізичний ліміт: В реальності всі використовують Maximum Transmission Unit (MTU) — 1500 байтів
         Це золотий стандарт сучасного обладнання


         ЧОМУ НЕ ВИКОРИСТОВУЄТЬСЯ ТЕАОРЕТИЧНИЙ МАКСИМУМ:
         ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

         —> НАДІЙНІСТЬ

              — Якщо в пакеті на 64 КБ пошкодиться хоча б один біт — доведеться пересилати всі 64 КБ заново

              — У пакеті на 1500 байтів втрати мінімальні й пересилання одного маленького шматка відбудеться миттєво


         —> ШВИДКІСТЬ

              — Через кабель (домашній або глобальний) одночасно циркулюють дані для багатьох різних IP-адрес

              — Великий пакет занадто довго займає потік, тим самим заморожує мережу й не дає інтернету працювати
                стабільно для усіх вузлів

              — Розбиття на маленькі пакети забезпечує справедливу черговість: кожен пакет має однакову довжину,
                тому вони обробляються з однаковою швидкістю і чергуються

              — ПРИКЛАД: Маленький пакет вагою 1500 байтів не чекатиме, поки гігантський пакет на 60 000 байтів
                завершить рух. Він проскочить в потік між маленькими шматками великих даних


         —> ГЛОБАЛЬНА СУМІСНІСТЬ:

              — Світове обладнання налаштоване на стандарт 1500 байтів. Це "залізне" правило для більшості мережевих
                карт та роутерів

              — Якщо роутер отримає пакет більшого розміру (наприклад, 4000 байтів), а кабель далі пропускає лише 1500,
                роутер буде змушений різати пакет на ходу

                            ————————————————————————————————————————————————————————————————————————————————————————————

——————
 4. TTL (Time to Live — 8 бітів) — час життя пакета
——————
       ◦ Це запобіжник, який не дає пакету циркулювати в мережі вічно, якщо він заблукав або потрапив у кільце через
         помилку налаштування роутерів

       ◦ ЯК ЦЕ ПРАЦЮЄ:

              1. Кожен пристрій, що створює пакет записує в це поле початкове число (зазвичай 64 або 128)

                                                 ———————————————————————————————————————————————————————————————————————
                                                    Роутер, через який проходить пакет називають ВУЗЛОМ

                                                    Процес проходження пакету через роутер називають ХОП (hop — стрибок)
                                                 ———————————————————————————————————————————————————————————————————————

              3. Кожен роутер, який приймає пакет і пересилає його далі, обов'язково зменшує значення TTL на 1

              4. Як тільки число стає рівним 0, роутер зобов'язаний дропнути пакет. Він не передає його далі, а просто
                 стирає з пам'яті


       ◦ НАВІЩО ЦЕ ПОТРІБНО:

              • Без TTL один помилковий маршрут міг би зациклити пакет між двома роутерами назавжди

              • Мільярди таких заблукалих пакетів дуже швидко забили б собою всі світові кабелі, і інтернет просто
                перестав би працювати



——————
 5. Protocol (Протокол — 8 бітів)
——————

   Це вказівник, який миттєво повідомляє вузлу (роутеру чи комп'ютеру), за яким саме протоколом потрібно реагувати
   та обробляти вміст цього пакета


                      ————————————————  НАВІЩО РОУТЕРУ ЗНАТИ ТИП ПРОТОКОЛУ  —>  ПРІОРИТЕТ ТА БЕЗПЕКА  ——————————————————

                       Роутер — це вузьке перехрестя. Пакетів прилітає більше, ніж кабель може пропустити за одну
                       мілісекунду

                       Роутеру треба вибрати кого пріоритизувати та пропустити першим


                             ◦ ПРІОРИТЕЗАЦІЯ:

                                 Роутер дивиться в поле Protocol. Бачить 17 (UDP) — він розуміє, що це дзвінок або гра,
                                 де кожна мілісекунда на рахунку —> й пропускає цей пакет першим

                                 Потім він бачить 6 (TCP) — він розуміє, що це файл або сайт, який може почекати зайву
                                 секунду в черзі

                             ◦ БЕЗПЕКА (Firewall)

                                 Firewall (вогняна стіна) — це цифровий бар'єр, який контролює весь трафік між нашою
                                 локальною мережею (або комп'ютером) і зовнішнім світом (інтернетом)

                                 Ми можемо налаштувати роутер щоб він блокував всі пакети з протоколом 17 (UDP)



                      ——————————————————————————————————  СИТУАЦЇ КОЛИ ЦЕ ПОТРІБНО  ————————————————————————————————————

                        1. Захист від хакерських атак

                             ПРОБЛЕМА:
                                 Хакери можуть спрямувати на сервер мільйони порожніх UDP-пакетів.
                                 Оскільки UDP не потребує підтвердження, він забиває канал зв'язку так швидко,
                                 що реальні пакети даних не можуть пробитися.

                             РІШЕННЯ:
                                 Адмін каже роутеру: Поки йде атака — просто видаляй усі пакети з протоколом 17 (UDP).
                                 Це миттєво знімає навантаження з сервера, і пакети з протоколом 6 (TCP) продовжують
                                 надходити безперебійно

                                                                                    ————————————————————————————————————

                        2. Корпоративна політика (Економія трафіку)

                             ПРОБЛЕМА:
                                 Співробітники офісу, який і так має слабкий інтернет, замість роботи дивляться
                                 трансляції або постійно сидять у відеодзвінках, які з'їдають весь канал.

                             РІШЕННЯ:
                                 Адмін може заблокувати протокол 17 (UDP).
                                 Пошта і робочі сайти (TCP) працюють ідеально, а от Zoom, Telegram-дзвінки або інші
                                 стріми просто не запустяться.

                                 Роутер відсікає їх на рівні протоколу в IP хедері, не витрачаючи час на розбір того,
                                 що саме всередині.



                      ————————————————————————————————  РОЗПОДІЛ ОБОВ'ЯЗКІВ У МЕРЕЖІ  ——————————————————————————————————

                        1. Роутери

                           ЗАВДАННЯ: Просто доставити пакет за вказаною IP-адресою, використовуючи таблиці
                           маршрутизації та логіку NAT, де це необхідно

                           ОСОБЛИВІСТЬ: Роутер не відповідає за порядок пакетів або їх цілісність
                           Він лише працює як кур'єр

                        2. Комп'ютер

                           ЗАВДАННЯ: Вся логіка TCP (перевірка, черга, підтвердження) або UDP (миттєва передача)
                           виконується вже різними модулями в операційній системі

                           ОСОБЛИВІСТЬ: Саме тут дані розпаковуються і сортуються.
                           Якщо пакет загубився в дорозі (на роутерах), саме модуль ОС на комп'ютері це помітить і
                           вирішить, що робити далі (перезапитати в TCP або ігнорувати в UDP).


                      ————————————————————————————  НАВІЩО КОМП'ЮТЕРУ ЗНАТИ ТИП ПРОТОКОЛУ  —————————————————————————————

                        1. ДИСПЕТЧЕРИЗАЦІЯ (вибір програмного модуля за протоколом)

                            Це процес розподілу завдань. Від номера в полі Protocol залежить, який програмний модуль
                            ОС оброблятиме дані.

                            Тобто коли приходить пакет, операційна система (ОС) працює як диспетчер:
                            вона дивиться на номер у полі Protocol і миттєво перенаправляє пакет до потрібного модуля

                            Це необхідно, бо модуль TCP не розуміє структуру UDP, і навпаки.


                                Модуль TCP — виконує складну логіку:
                                ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                      ◦ Перевіряє черговість отриманих пакетів та впорядковує їх

                                      ◦ Накопичує пакети у пам'яті до отримання всіх частин і автоматично звітує
                                        відправнику про успішне отримання (ACK)

                                      ◦ Якщо черговість порушена — чекає на необхідний пакет

                                      ◦ Якщо дані биті — відправляє запит на повторне пересилання пакета


                                Модуль UDP — виконує мінімальну логіку
                                ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                      ◦ Просто передає дані програмі як вони є, забезпечуючи максимальну швидкість
                                        без жодних перевірок та звітів



                        2. ВИДІЛЕННЯ СИСТЕМНИХ РЕСУРСІВ (Пам'ять)  —————————————————————————————————————————————————————

                            Протоколи мають різний вплив на ресурси комп'ютера:

                                Для TCP (6):
                               ‾‾‾‾‾‾‾‾‾‾‾‾‾
                                   ОС автоматично резервує частину оперативної пам'яті під Receive Buffer

                                   Це місце, де пакети будуть зберігатися та сортуватися за номерами, поки не зберуться
                                   у правильному порядку

                                   Також процесор виділяє ресурси на постійне обчислення та відправку
                                   пакетів-підтверджень (ACK)


                                Для UDP (17):
                               ‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                   ОС не резервує пам'ять для сортування

                                   Процесор просто копіює дані з пакета і відправляє їх напряму в додаток
                                   (наприклад, у відеоплеєр)

                                   Це мінімізує використання ресурсів на перевірки



                        3. ФОРМАТ НАСТУПНОГО ЗАГОЛОВКА  ————————————————————————————————————————————————————————————————

                            Поле Protocol каже комп'ютеру, як читати наступні байти після IP-заголовка

                            Після 20 байтів IP-заголовка йде наступний заголовок (транспортного рівня)

                            У TCP і UDP ці заголовки мають різну структуру та довжину:

                                  ◦ UDP (Протокол №17) — Дуже короткий заголовок (8 байтів)

                                  ◦ TCP (Протокол №6) — Довгий заголовок (мінімум 20 байтів)

                            Без номера протоколу комп'ютер не знатиме за яким алгоритмом розбирати наступний залоголок



                      —————————————————————————————————  ТРИ ОСНОВНІ НОМЕРИ ПРОТОКОЛІВ  ————————————————————————————————


                        1. TCP (Transmission Control Protocol — Протокол Керування Передачею) — Протокол №6

                           Transmission (передача) — процес переміщення даних від одного комп'ютера до іншого


                              ◦ Це протокол з попереднім встановлення з'єднання (Three-Way Handshake):

                                   Three-Way Handshake — обов'язкова попередня перевірка зв'язку між двома комп'ютерами,
                                   якою вони підтверджують готовність приймати та передавати дані.

                                   А також синхронізують свої лічильники: з якого саме номера почнеться нумерація
                                   пакетів, щоб потім розуміти, чи всі дані йдуть у правильному порядку.


                                          ——————————————  Window Size (Розмір вікна) — керування порціями  —————————————

                                           В TCP-заголовку є поле Window Size, через яке комп'ютери узгоджують об'єм
                                           даних, що передається без зупинки на очікування підтвердження (AСK):

                                              ◦ При Handshake комп'ютер повідомляє серверу: Мій буфер (пам'ять) готовий
                                                прийняти порцію розміром у 64 КБ

                                              ◦ Суть команди: Відправляй пакети один за одним, доки їхня сумарна вага
                                                (чисті дані без заголовків) не досягне 64 КБ.

                                                Поки цей ліміт не вичерпано, не чекай від мене підтвердження (ACK)


                                              ◦ Результат: Сервер вистрілює всю пачку пакетів без пауз, що значно
                                                пришвидшує передачу

                                                На кожний отриманий буфер пакетів отримувач має надіслати підтвердження,
                                                інакше комп'ютер відправника почне перевідправлення цієї порції заново

                                                Щойно порція отримана і підтверджена, процес повторюється


                                          ————————————  Коли програми (браузер, відеоплеєр) отримують дані  ————————————

                                           Комп'ютер не чекає на завантаження всього файлу. Він обробляє дані невеликими
                                           порціями (буферами)

                                           УМОВА ПЕРЕДАЧІ: Програма отримує дані лише тоді, коли всередині поточної
                                           порції всі пакети стоять у правильному порядку і немає дірок

                                           ОЧІКУВАННЯ: Якщо один пакет загубився, вся порція завмирає в буфері, чекаючи
                                           поки втрачений пакет не буде пересланий заново і не займе своє місце

                                           ДЛЯ КОРИСТУВАЧА: Це виглядає як завмирання відео (буферизація) або часткове
                                           завантаження сайту (наприклад, текст є, а стилів чи картинок ще немає)

                                           Щойно дірка заповнюється — програма миттєво отримує весь накопичений буфер

                                          ——————————————————————————————————————————————————————————————————————————————

                              ◦ TCP гарантує доставку цілісних і послідовних даних через механізм повторних спроб
                                (або відміну доставки взагалі):

                                    Механізм підтвердження (ACK):
                                   ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                         Після відправки порції сервер чекає на підтвердження, бо TCP працює за
                                         принципом «МОВЧАННЯ — ЦЕ ПОМИЛКА»


                                    Обов’язок отримувача:
                                   ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                         Якщо комп'ютер прийняв порцію, він зобов'язаний відправити назад пакет з
                                         прапорцем ACK та номером наступного очікуваного пакета


                                    Таймер очікування:
                                   ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                         Відправник, надіславши порцію, засікає час

                                         Якщо підтвердження (ACK) не надійшло до закінчення таймера, відправник
                                         автоматично вважає порцію втраченою й перевідправляє її заново


                                    Ліміт спроб:
                                   ‾‾‾‾‾‾‾‾‾‾‾‾‾
                                         Це триває до тих пір, поки дані не будуть отримані без помилок, або поки не
                                         вичерпається ліміт спроб (5-15 разів), після чого з'єднання розривається



                              ◦ Контроль черговості (Ordering)

                                    TCP гарантує контроль черговості, шляхом нумерації кожного пакета

                                    Якщо пакети прийшли в неправильному порядку (пакет №2 прийшов раніше за №1),
                                    TCP затримує їх (буферить) й чекає на прихід пакета №1.

                                    Щойно дірка заповнена, він миттєво збирає їх у правильній послідовності і лише
                                    тоді передає програмі



                        2. UDP (User Datagram Protocol) — Протокол №17 —————————————————————————————————————————————————

                           User Datagram Protocol — Протокол користувацьких датаграм

                             Жодних гарантій:
                             ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                  Це протокол без попереднього встановлення зв'язку (handshake) та без гарантій
                                  цілісності чи послідовності даних

                             Втрати — це норма:
                             ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                  Якщо пакет загубився в дорозі, UDP ніколи не просить його перевідправити.
                                  Для цього протоколу швидкість і мінімальна затримка важливіші за 100% точність


                              Відсутність підтверджень:
                              ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                  Відправник просто передає потік пакетів на IP-адресу та порт отримувача
                                  Він не перевіряє, чи були дані отримані, чи вони загубилися в дорозі


                              Мінімальні затримки:
                              ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                  Оскільки UDP не витрачає час на рукостискання (handshake) та очікування підтверджень,
                                  дані передаються максимально швидко


                              Логіка обробки :
                              ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                  1. ЯДРО:

                                     ◦ Пакет аналізується ядром ОС і, залежно від Destination Port (порту призначення),
                                       кладеться у буфер відповідного сокета UDP Table, очікуючи виклику з програми

                                     ◦ Ядро не сортує UDP-пакети за актуальністю. Воно віддає їх програмі в тому
                                       порядку, в якому вони фізично прилетіли з мережі, тобто за принципом FIFO
                                       (First In, First Out).


                                  2. СОФТ:

                                     ◦ Програма робить активний системний запит (System Call) на отримання даних безліч
                                       разів на мілісекунду

                                     ◦ За один такий запит програма забирає з UDP-буфера (Receive Buffer) всі пакети,
                                       які встигли там накопичитися

                                     ◦ Оскільки в UDP-заголовку немає нумерації (як Sequence Number у TCP),
                                       софт самостійно аналізує payload пакету й шукає часові мітки (timestamps) або
                                       внутрішні порядкові номери які були туди додані


                                     ◦ Отримавши пачку пакетів (наприклад, кадри відеодзвінка), й звіривши їхні
                                       часові мітки, програма обробляє лише той пакет, який має найсвіжішу (актуальну)
                                       мітку

                                     ◦ Всі інші пакети, що запізнилися, програма просто ігнорує (дропає),
                                       оскільки інформація в них уже застаріла




                        3. ICMP (Internet Control Message Protocol) — Протокол №1 ——————————————————————————————————————

                              Призначення: Діагностика та повідомлення про помилки при доставці IP-пакетів
                             ‾‾‾‾‾‾‾‾‾‾‾‾‾

                              Як працює:
                             ‾‾‾‾‾‾‾‾‾‾‾
                                  ◦ Не має портів

                                  ◦ Не передає файли: використовується суто для сервісних повідомлень

                                  ◦ ICMP-пакет автоматично створюється мережевим вузлом у двох випадках:

                                      • ПОМИЛКА: Пакет неможливо доставити (неможливість доставки, вийшов час життя TTL)

                                      • ДІАГНОСТИКА: Прийшов запит на перевірку існування IP-адреси (ping)


                              Основні типи повідомлень:
                             ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                1. TYPE: Destination Unreachable (Неможливість доставки)

                                    Відправнику автоматично генерується й відправляється ICMP пакет цього типу у таких
                                    випадках:

                                       ◦ Коли IP-адреса не знайдена в таблицях маршрутизації (не існує або не унікальна)

                                       ◦ Коли в процесі NAT на роутері не виявлено збігу порту в таблиці

                                       ◦ Коли пакет з таким протоколом заблокований firewall на роутері або комп'ютері
                                         через reject

                                       ◦ Коли пакет дійшов до комп'ютера але цей порт вже закритий (закрита вкладка або
                                         ціла програма - наприклад браузер)



                                2. TYPE: Time Exceeded (Закінчення часу життя (TTL))

                                    Кожен IP-пакет має ліміт переходів (hops). Якщо ліміт став рівним 0, роутер
                                    знищує пакет і шле назад ICMP пакет Time Exceeded



                                3. TYPE: Echo Request / Echo Reply (Запит / Відповідь діагностики)

                                    ◦ Echo Request (запит): Ініціюється користувачем (через команду ping) або
                                      спеціальними програмами для моніторингу, щоб перевірити доступність вузла та
                                      швидкість з'єднання

                                    ◦ Echo Reply (відповідь): Вузол-отримувач, побачивши тип Echo Request, зобов'язаний
                                      згенерувати Echo Reply


——————————————————————————————————  Логіка обробки даних (Application Layer + TCP)  ————————————————————————————————————


     Розподіл ролей: Комп'ютер vs Програма
     ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

         1. Роль комп’ютера (Операційної системи)

               Як тільки TCP-модуль зібрав першу порцію пакетів і переконався, що вона цілісна й пакети йдуть у
               правильному порядку, він не тримає їх у себе. Комп’ютер одразу передає їх програмі.


         2. Роль програми (Chrome, Email, Youtube etc.)

               Програма отримує цю порцію від комп'ютера і має два варіанти дій:

                  — Варіант А: Чекати все
                      Накопичувати дані в пам'яті й чекати, поки TCP не передасть останню порцію, й тільки після цього
                      показувати результат

                      Цей варіант обирає пошта (Email): Лист з'явиться лише тоді, коли він завантажений на 100%


                  — Варіант Б: Потокова обробка
                      Починати обробляти порції під час отримання, не чекаючи на весь файл

                      Цей варіант обирають браузери. Вони використовують Incremental Rendering (поступову відмальовку)

                      Як тільки перша порція з HTML-кодом потрапила до браузера, він відразу починає будувати дерево
                      елементів (DOM) і виводити їх на екран



     Детальний розбір:
     ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

         1. Відео та фільми (YouTube, Netflix) —> ПОТОКОВА ОБРОБКА З РИЗИКОМ ЗАВМИРАННЯ ВІДЕО АБО ЗУПИНКИ НАЗАВЖДИ

                Порційність:
                ‾‾‾‾‾‾‾‾‾‾‾‾
                      Дані надходять порціями, що дозволяє дивитися відео, не чекаючи повного завантаження файлу


                Завмирання:
                ‾‾‾‾‾‾‾‾‾‾‾
                      Якщо пакет втрачено й не має буферної зони, відео завмирає

                      Якщо ж буферна зона є, TCP встигне перевідправити втрачений пакет непомітно для нас
                      (без завмирання відео)


                Зупинка назавжди:
                ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                      Поки TCP намагається знайти пакет, відео стоїть на паузі.
                      Якщо після всіх спроб пакет так і не вдалося передати, TCP розриває з'єднання

                      Плеєр YouTube або Netflix крутитиме коліщатко нескінченно, а потім видасть помилку:
                      «Перевірте підключення до інтернету»

                      Оскільки це TCP, а не UDP, протокол не може просто перестрибнути діру в даних.
                      Відео зупиниться там, де закінчилася остання цілісна порція, й плеєр видасть помилку підключення




         2. Веб-сайти — ПОТОКОВА ОБРОБКА З РИЗИКОМ ПОМИЛКИ

                Поступовість:
                ‾‾‾‾‾‾‾‾‾‾‾‾‾
                     Браузер відображає сайт поступово, як тільки TCP віддає йому першу порцію коду


                Відповідальність за помилку:
                ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                     Сам TCP протокол гарантує, що передасть дані ком'ютеру цілісними і послідовними або розірве
                     з'єднання (ніколи не передасть биті дані)

                     Те, що браузер обирає малювати сайт з неповних даних (з ризиком помилки), не є відповідальністю TCP


                                          ————————————————————————————  Механіка помилки:  —————————————————————————————

                                            Якщо при надсиланні останніх порцій виникне помилка з'єднання або пакет
                                            загубиться, і повторні спроби переслати його не дадуть результату,
                                            TCP просто припинить передачу й поверне помилку

                                            Браузер, який вже відмалював більшу частину сайту, залишиться зі зламаним
                                            сайтом, який має неповний код (наприклад, текст є, а кнопки не працюють)

                                            Ця ситуація є наслідком логіки роботи браузера, а не помилкою самого TCP

                                          ——————————————————————————————————————————————————————————————————————————————

         3. Пошта — ЦІЛІСНА ОБРОБКА

                Неподільність:
                ‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                     Лист — це неподільний об'єкт для програми

                     Поштова програма не покаже нам лист, поки TCP не підтвердить збірку всіх пакетів на 100%

                     Тут діє принцип ВСЕ АБО НІЧОГО: Ми отримаємо лист повністю і в ідеальному стані, або, у разі
                     помилки, не отримаємо його взагалі




————————————————————————————————  Детальний розбір різниці між TCP та UDP на практиці  —————————————————————————————————

 1. TCP (Протокол №6)

       ◦ ПРІОРИТЕТ: Для цього потоколу найголовніше щоб комп'ютер отримувача отримав цілісні і послідовні дані
         (пакет №4 завжди має оброблятися після пакету №3)

       ◦ ЛОГІКА: Якщо пакет №3 загубився, а пакет №4 вже прийшов — система зупиняє чергу
         Вона не віддасть цей буфер (порцію) програмі, поки не переотримає пакет №3

       ◦ РЕЗУЛЬТАТ: Ми отримуємо повноцінні дані без втрат, але з можливими затримками (підвисаннями)

       ◦ МАРКЕР: Якщо ми можемо натиснути на паузу, щоб відео підвантажилося — це TCP


       ПРИКЛАДИ:
                                                                     ———————————————————————  1  ———————————————————————

                     При просмотрі відео або фільма (на Netflix або Youtube) у нас не буде стрибка з однієї частини
                     відео на іншу

                     Якщо якийсь пакет заблукав — відео призупиниться (візуально зависне) і буде чекати на втрачений
                     пакет, й тільки після його отримання, коли буфер збереться, піде далі

                     За цією ж логікою ми можемо накопичувати дані (буферизація): смужка завантаження фільма вийде
                     далеко за межі частини, яку ми дивимося.
                     Тоді, якщо пакет заблукає, ми цього навіть не помітимо, бо у нас є запас даних, і зависання не буде

                                                                     ———————————————————————  2  ———————————————————————

                     Веб-сайти: Браузер відображає сайт поступово, але TCP не дозволяє завантажувати дані з дірками.

                     Якщо пакет №3 із CSS-стилями втрачено, TCP призупинить передачу наступних порцій, поки не отримає
                     цей пакет, щоб сайт не відображався з помилками

                                                                     ———————————————————————  3  ———————————————————————

                     Пошта: TCP не дасть заголовку листа або іншій його частині загубитися — ви отримаєте лист
                     повністю або не отримаєте взагалі (з повідомленням про помилку)

                     Але ніколи не отримаєте половину повідомлення



                     ЛОЗУНГ TCP: АБО ВСЕ АБО НІЧОГО —> ЗАБЕЗПЕЧЕННЯМ ЦІЛІСНОСТІ
                     ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾


 2. UDP (Протокол №17)

        ◦ ПРІОРИТЕТ: Актуальність (Реальний час)
          Цей протокол концентрується на швидкісті замість перевірок. Йому важливіше отримати актуальні дані прямо зараз

        ◦ ЛОГІКА: Якщо якийсь пакет загубився — він вже застарів. Немає сенсу чекати на нього і гальмувати весь потік.
          Програма його просто скіпає. Нам важливіше отримати те, що відбувається зараз

        ◦ РЕЗУЛЬТАТ: Ми отримуємо миттєву реакцію. Якщо дані губляться — ми бачимо глюк або перестрибування кадру,
          але ми завжди залишаємося в реальному часі

        ◦ МАРКЕР: Якщо відбувся збій, картинка смикнулася і ми одразу бачимо актуальний момент (а не додивлюємося те,
          що було 2 секунди тому)


       ПРИКЛАДИ:

                     Якщо під час дзвінка, відеодзвінка (Zoom, Telegram, FaceTime) або онлайн-ігри відбувається збій
                     (гра або трансляція заглючила), за UDP-протоколом важливіше якнайшвидше отримати актуальні дані

                     Тобто повернутися в саму в відеотрансляцію або гру в реальному часі, а не програвати застарілу
                     частину (яка йде по порядку)
                     Інакше ми б завжди відставали від реального часу на секунди затримки



                     ЛОЗУНГ UDP: АКТУАЛЬНІСТЬ ЦІНОЮ ВСЬОГО
                     ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾



——————
 6. Source IP Address (Адреса відправника — 32-біта)
——————
   Це IP адреса вузла, який сформував пакет. Вона потрібна для того, щоб вузол-отримувач знав, куди надсилати відповідь


——————
 7. Destination IP Address (Адреса отримувача — 32-біта)
——————

              САМЕ ЦІ ДВА ОСТАННІ ПОЛЯ ЗАЗНАЮТЬ ЗМІН ПРИ ПРОХОДЖЕННІ РОУТЕРІВ, ЯКЩО ЗАДІЯНА ЛОГІКА NAT





——————————————————————————————————————————————  IP (Internet Protocol)  ————————————————————————————————————————————————

 Оскільки перші 20 байтів будь-якого пакета — це IP Header, абсолютно кожна одиниця в мережі (host - вузол) обов'язково
 повинна мати IP-адресу

                                         IP АДРЕСИ РОЗДІЛЯЮТЬ НА ДВА ТИПИ:

 1. Public IP address (біла IP-адреса)
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
    Це унікальна адреса в глобальній мережі

    ◦ ПРЯМА ВИДИМІСТЬ: Будь-який інший вузол в інтернеті може надіслати пакет на цю адресу, і він дійде до цілі в
      незмінному вигляді (без зміни IP хедеру)

    ◦ ВІДСУТНІСТЬ TRANSLATION: З'єднання відбувається напряму — без маршрутизаторів-посередників, які використовують
      NAT-логіку для підміни адрес у заголовках

    ◦ ПРИЗНАЧЕННЯ: Зазвичай таку адресу мають сервери, сайти або роутери провайдерів



2. Private IP address (сіра або локальна IP-адреса)
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
   Це адреса, яка діє виключно всередині обмеженої локальної підмережі, створеної маршрутизатором

  ІЄРАРХІЯ ПІДМЕРЕЖ:

     1. Провайдер має обмежену кількість Public IP адрес

     2. Він створює свою підсистему локальних адрес і надає нашому домашньому роутеру, як і тисячам інших клієнтів,
        унікальну в межах цієї підсистеми сіру IP-адресу — про її існування знає лише роутер провайдера

     3. Наш домашній роутер, будучи частиною системи провайдера, створює ще одну, ще дрібнішу підсистему для наших
        девайсів (ноутбука, смартфона)


    ◦ ВІДСУТНІСТЬ ПРЯМОЇ ВИДИМОСТІ:

          • Про нашу локальну IP-адресу знає лише наш роутер

          • Про сіру IP-адресу нашого роутера знає лише роутер провайдера

          • Глобальні роутери ігнорують такі адреси, тому що вони не є унікальними. Це значить що з глобального
            інтернету неможливо надіслати пакет на сіру адресу напряму


    ◦ ЛОКАЛЬНА УНІКАЛЬНІСТЬ Й ВІДСУТНІСТЬ ГЛОБАЛЬНОЇ УНІКАЛЬНОСТІ:

          • Маршрутизатор, який створює підсистему, слідкує щоб всередині його мережі адреси не повторювалися

          • Для локального використання в глобальному інтернеті зарезервовані спеціальні діапазони для створення сірих
            та локальних IP адрес (роутери самі видають останні числа)

                • 192.168.x.x — для створення локальних адрес в підсистемі домашнього роутера

                • 10.x.x.x або 100.64.x.x — для створення сірих адрес в підсистемі роутерів провайдерів


            Й коли глобальний роутер бачить у заголовку пакета таку адресу, він не може визначити, якому саме з
            мільйонів інших таких же сірих IP адрес його доставити

            Для нього цей пакет не має валідної адреси призначення, тому він його просто дропає (видаляє)


    ◦ НЕОБХІДНІСТЬ NAT:

          • Глобальні роутери бачать лише одну унікальну Public IP адресу провайдера.
            Сірі адреси пристроїв глибше фізично видимі в пакетах, але не є унікальними, тому ігноруються глобальною
            мережею як невалідні.

          • NAT логіка: Оскільки пристрій із сірою IP не може отримати прямий запит або відповідь із зовнішньої
            мережі, він зобов’язаний використовувати логіку NAT (Network Address Translation)





—————————————————————————————————————————  NAT (Network Address Translation)  ——————————————————————————————————————————

    ◦ LAN (Local Area Network — локальна мережа) — підмережа, якою керує домашній роутер

    ◦ MAN (Metropolitan Area Network — міська мережа) — підмережа, якою керує роутер провайдера

    ◦ WAN (Wide Area Network) — глобальна мережа Internet, де працюють глобальні роутери


 Роутер (Маршрутизатор) — це спеціалізований комп'ютер, який призначений для з'єднання мереж

      —> Домашній роутер з'єднує локальну мережу (LAN) з мережею провайдера (MAN)

      —> Роутер провайдера з'єднує свою мережу (MAN) з глобальною мрежею (WAN або Internet)



 ЙОГО ГОЛОВНЕ ЗАВДАННЯ: Логіка NAT (Network Address Translation — Переклад Мережевих Адрес)

 Оскільки пристрій із сірою IP-адресою не може отримати прямий запит або відповідь із зовнішньої мережі, кожен
 маршрутизатор у ланцюжку виконує трансляцію (переклад), щоб пакет зміг піднятися в мережу на рівень вище


 1. ВИХІДНИЙ ПОТІК (Запит у мережу)
 Коли пакет проходить крізь маршрутизатор, маршрутизатов вносить дві зміни в хедерах пакету:

    ◦ Зміна IP Header: Він витирає нашу сіру IP-адресу (Source IP) і записує замість неї ту, яку отримав від системи рівнем вище (свою сіру або публічну IP).

Зміна TCP Header (Порти): Оскільки через одну IP одночасно можуть виходити в мережу багато пристроїв, роутер призначає кожному запиту унікальний номер порту (наприклад, :50001).

Запис у NAT-таблицю: Роутер фіксує в пам'яті зв'язку:

Зовнішній Порт 50001 <—> Локальна IP ноутбука + його внутрішній порт.

2. Вхідний потік (Відповідь від сервера до тебе)
Коли сервер присилає байти у відповідь:

Ідентифікація за портом: Сервер надсилає дані на IP роутера і порт :50001.

Пошук у таблиці: Роутер бачить порт :50001, звіряється зі своєю таблицею і розуміє: "Ці дані призначені ноутбуку з локальною адресою 192.168.1.5".

Зворотна підміна: Роутер знову переписує IP Header (вписує локальну IP ноутбука) і відправляє пакет у твою підсистему.




    Коли пакет проходить крізь маршрутизатор, відбуваються зміни в headers пакету:

Зміна IP Header: Маршрутизатор замінює локальну IP-адресу відправника на ту адресу, яку він сам має у мережі рівнем вище.

Твій роутер міняє твою IP на свою сіру адресу, щоб пакет потрапив у MAN (мережу провайдера).

Роутер провайдера міняє сіру адресу твого роутера на Public IP, щоб пакет потрапив у WAN (глобальний інтернет).

Зміна TCP Header (Порти): Оскільки одна IP-адреса обслуговує багато вузлів одночасно, маршрутизатор призначає кожному запиту унікальний номер порту (Source Port).

Формування NAT-таблиці: Маршрутизатор фіксує у пам'яті зв'язку:
Вхідна IP + Порт <—> Вихідна IP + Новий Порт.

2. Вхідний потік (Відповідь із мережі)
Коли дані повертаються, процес іде у зворотному порядку:

Ідентифікація: Пакет приходить на порт, який маршрутизатор забронював під цей конкретний запит.

Пошук: Маршрутизатор звіряється з таблицею і знаходить, якому саме вузлу в його підсистемі належить ця відповідь.

Зворотна заміна: Маршрутизатор знову переписує IP Header, повертаючи пакету ту адресу, яку вузол мав у цій локальній підмережі.

Підсумок етапів перекладу:
Host (LAN) -> Домашній роутер: Твоя IP міняється на сіру IP провайдера. Тепер пакет валідний для мережі MAN.

Домашній роутер -> Роутер провайдера: Сіра IP міняється на Public IP. Тепер пакет валідний для мережі WAN.

Тільки після цих двох етапів трансляції дані отримують можливість бути обробленими глобальними роутерами, оскільки тепер у заголовку вказана Public IP.







       ◦ ПЕРЕКЛАД (ПІДМІНА) АДРЕС: Оскільки в тебе вдома багато пристроїв, а зовнішня IP-адреса одна, роутер замінює локальну IP пристрою (наприклад, твого ноутбука) на публічну IP.

Керування портами: Щоб не переплутати відповіді, роутер для кожного нового запиту відкриває окремий номер порту.

Приклад: Запит від ноутбука він шле через порт 5001, а запит від телефона — через 5002.

Таблиця трансляції (NAT Table): Роутер записує у свою пам'ять: "Порт 5001 = ноутбук". Коли дані повертаються з інтернету на цей порт, роутер дивиться в запис і миттєво розуміє, кому саме в квартирі їх віддати.


—————————————————————————————————————————  Double NAT  ——————————————————————————————————————————

Подвійним NAT-ом (Double NAT). Це саме те, як живе 90% сучасного домашнього інтернету.

Як працює сучасна підміна адрес (Double NAT)


 КРОК 1: Наш домашній роутер (маршрутизатор)
‾‾‾‾‾‾‾‾
Твій ноутбук має локальну адресу (наприклад, 192.168.1.5).

Дія: Роутер забирає пакет, замінює твою адресу на ту «сіру» адресу, яку йому дав провайдер (наприклад, 10.50.20.10).

Порт: Він відкриває порт (наприклад, :5001) і записує в таблицю: Порт 5001 = Ноутбук.

Крок 2: Роутер провайдера (Рівень міста/району)
Тепер пакет приходить на гігантську машину провайдера. Для неї твій роутер — це просто ще один клієнт із локальною адресою 10.50.20.10.

Дія: Провайдерський роутер затирає твою «сіру» адресу і ставить ту саму єдину Публічну IP, яку бачить весь інтернет.

Порт: Він відкриває свій новий порт (наприклад, :22334) і записує: Порт 22334 = Роутер клієнта на 10.50.20.10.

Крок 3: Шлях назад (Коли прийшла відповідь)
Коли сервер (наприклад, Gmail) надсилає відповідь, вона проходить цей шлях дзеркально:

Провайдер бачить порт 22334 → дивиться в таблицю → віддає твоєму домашньому роутеру.

Твій роутер бачить порт 5001 → дивиться в таблицю → віддає твоєму ноутбуку.




————————————————————————————————————————————  Анатомія TCP хедера (IPv4)  ——————————————————————————————————————————————


                                         НАЙГОЛОВНІШІ ПОЛЯ TCP ХЕДЕРА
                                         ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾


——————
 1. Source Port (16 бітів) та Destination Port (16 бітів)
——————

                      ————————————————————————————————————————————  ПОРТ  ——————————————————————————————————————————————

                         Порт — це числовий індекатор (мітка), який потрібен виключно Операційній Системі (OS) для
                         сортування даних між запущеним софтом


                            Нащо він потрібен:
                           ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                 За допомогою IP адреси пакет даних транспортується з одного ком'ютера на інший
                                 (маршрутизація між пристроями)

                                 Але на одному комп'ютері (одна IP-адреса) одночасно можуть працювати десятки програм
                                 (наприклад: Airbnb у вкладці, Telegram-дзвінок, онлайн-гра, фонове оновлення системи)

                                 Й без порту комп'ютер не міг би зрозуміти, якому саме процесу (софту) належить пакет,
                                 що прийшов

                                 Порт — це єдиний спосіб для ОС доставити пакет у потрібне вікно програми



                            Діапазон чисел:
                           ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                 Під поле порту виділено 16 бітів, тож максимальне число, яке ми можемо туди записати —
                                 це 65 535

                                 Оскільки в розробці відлік починається з нуля, порт має діапазон від 0 до 65 535

                                 Це дає нам рівно 65 536 унікальних варіантів (комбінацій) для ідентифікації софту





————————————————————————————————————————————————————  Socket Table  ————————————————————————————————————————————————————

 Socket Table (Таблиця сокетів) — це загальна назва для структур даних у пам'яті ядра ОС, які зберігають записи про
 активні мережеві з'єднання (сокети)

 Ядро ОС (Kernel) — це центральна, найголовніша частина операційної системи, яка працює безпосередньо з залізом
 (процесором, RAM, дисками)

 Програми (Chrome, WebStorm, etc.) не мають прямого доступу до заліза й не є частиною ядра. Вони просять ядро створити
 сокет для них.


   Де знаходиться:
   ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
         Socket Tables знаходяться в оперативній пам'яті комп'ютера (RAM)

         RAM (Random Access Memory) — це тимчасова пам’ять, яку використовує комп’ютер, щоб зберігати програми, які
         зараз активно працюють, та дані, які вони зараз використовують

         При запуску комп'ютера в RAM завантажується Операційна Система, бо тільки там програми можуть працювати

         Саме під час завантаження ОС в RAM, ядро виділяє блок пам'яті під Socket Tables (окремо TCP Table та UDP Table)
         але цей блок на цьому етапі поки порожній

         Після вимкнення компʼютера вся інформація в RAM зникає, тому таблиці існують лише протягом одного сеансу роботи




   Socket:
   ‾‾‾‾‾‾‾
         Хедери в пакетах, як і самі дані — це просто послідовний набір байтів, який вміють читати роутери та комп'ютери

         Це не текст, а бінарний потік, де кожна позиція має конкретне значення


         Так само і сокет у пам'яті ядра виглядає як послідовний набір байтів (бінарна структура даних)

         Програма бачить сокет лише як число-ідентифікатор (File Descriptor), але в ядрі перативної пам'яті написані інструкції
 як зчитувати ці байти за зміщеннями (offsets)


           ◦ Перші 16 бітів (2 байти) — це Local Port

           ◦ Наступні 32 біти (4 байти) — це Local IP

 РІЗНИЦЯ В СТРУКТУРІ:

   Створення сокета:
   ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾


         1. Коли програма робить запит (спробу вийти в мережу) вона викликає функцію створення сокета (дає команду ядру)


         2. Ядро виділяє в RAM структуру (тобт виділяє блок пам'яті), присвоює їй вільний порт із таблиці портів й
            повертає програмі «ручку» (індикатор), за яку вона буде триматися.



————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————



   ◦ Для UDP-сокета на цьому послідовний набір байтів практично закінчується (додається лише вказівник на буфер
     (блок па'мяті) та PID програми)

   ◦ Для TCP-сокета набір байтів значно довший: ядро додає туди ще й Sequence Numbers (32 біти), Acknowledgment Numbers (32 біти) та поле st (state) — окремий байт-маркер, який вказує на поточний стан з'єднання (наприклад, LISTEN або ESTABLISHED).




Поле st (state) — окремий байт-маркер, який вказує на стан сокета (наприклад, LISTEN або ESTABLISHED).
 Хедери в пакетах даних як і самі дані - це просто послідовний набір байтів, який вміють читати роутери, та комп'ютери

 Так само й сокет у пам'яті ядра виглядає як послідовний набір байтів.

  Але ядро знає, що:

Перші 16 бітів — це Local Port.

Наступні 32 біти — це Local IP

й так далі

————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————




————————————————————————————————————————————————  UDP сокет (простий)  —————————————————————————————————————————————————

 UDP — це протокол «без стану» (stateless). ОС не потрібно стежити за чергою чи надійністю, тому запис у UDP Table
 дуже легкий. Він містить лише:

       1. Local IP + Local Port (IP пристрою й порт, присвоєний цьому сокету)

       2. Process ID (PID): Посилання на програму, якій треба віддати дані (наприклад, Telegram)




                      ———————————————————————————————————————  Process ID (PID)  ———————————————————————————————————————

                         PID — це унікальний цифровий ідентифікатор, який Ядро ОС присвоює кожному новому процесу.
                         Воно необхідне саме ядру для


                            Як видається:
                            ‾‾‾‾‾‾‾‾‾‾‾‾
                                 Process ID — це порядковий номер (ціле число)

                                 Ядро має лічильник: кожне нове звернення на створення процесу отримує наступне число
                                 (+1).

                                 Коли ліміт (наприклад, 65 535) вичерпується, ядро починає спочатку, пропускаючи зайняті
                                 номери


                            Коли створюється:
                            ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

                                  Коли робиться системний виклик Ядра на створення копії процесу (кожен процес не
                                  створюється з нуля, це схоже на прототипне наслідування в JS

                                  Приклад з JS Ми створюємо об'єкт process від класу new Process й тепер наш об'єст має доступ для
                                  усіх метовід класу new Process


                                  Системний виклик робиться у трьох випадках:

                                        1. Запуск будь-якої програми

                                        2. Відкриття нової вкладки в браузері (кожна нова вкладка = системний виклик на
                                           створнення процессу)

                                        3. Запуск скрипта (наприклад, виклик в терміналі node server.js)

                                           Скрипт — це наш файл із кодом. Процессор ядра не вміє читати та виконувати
                                           код, він прицює з бінарними потоками.Тож спершу треба перекласти наш код у
                                           зрозумілі процесору біти.

                                           Для цього нам необхідна програма, яка вміє це робити (інтерпретатор) — Node.js

                                           Коли ми пишемо у терміналі  node server.js  відбувається наступне:
                                                                       ‾‾‾‾‾‾‾‾‾‾‾‾‾‾
                                               1. Запит до Ядра: термінал просить Ядро створити новий процес

                                               2. Народження PID: Ядро створює процес для програми node, виділяє йому
                                                  RAM і дає PID

                                               3. Завантаження інтерпретатора: Ядро завантажує в пам'ять бінарний код
                                                  node

                                               4. Читання файлу: Програма node (вже маючи свій PID) відкриває наш файл
                                                  server.js, читає текст, перекладає його на лету в зрозумілі процесору
                                                  команди й передає йому





                            Створення:
                            ‾‾‾‾‾‾‾‾‾

                                 Запуск будь-якої програми — це звернення до Ядра (системний виклик)

                                 Команда Ядру: «Створи копію процесу, виділи йому ізольовану ділянку RAM і дай унікальне число (PID)».

Що таке PID: Це дійсно просто порядковий номер у списку процесів ОС. Він потрібен ядру, щоб не плутати «Браузер» з «Калькулятором» у черзі до процесора.

2. Зв’язок PID із Сокетом
Ти дуже влучно підмітила: PID не пов’язаний із мережею. Він пов’язаний із власністю.

Сокет — це «дитина» процесу.

Ядро записує PID у структуру сокета тільки для того, щоб знати: «Хто за це платить і хто має право це чіпати?».

Якщо програма закривається — ядро дивиться на «номерний знак» (PID) і видаляє всі сокети з таким самим знаком. Це суто адміністративний зв'язок.

       3. Receive Buffer (буфер прийому): Мала ділянка пам'яті, куди на мить падає пакет, поки софт його не забере





————————————————————————————————————————————————  TCP сокет (складний)  ————————————————————————————————————————————————


 TCP — протокол «зі станом» (connection-oriented). Запис у TCP Table набагато важчий, бо ядро має гарантувати порядок
 і цілісність. Окрім адрес і портів, він містить TCB  (TCP Control Block):



——————
 1. State (стан)
——————


                                 — В якому статусі з'єднання?

                                   У TCP Table для кожного сокета існує поле st (state)
                                   Ядро використовує його як перемикач (switch/case) для своєї логіки:

                                        LISTEN: Ядро ігнорує пакети з даними, чекає лише на пакет із прапорцем SYN


                                        LISTEN (Тільки на Сервері)
Коли: Після запуску програми (Node.js, WebStorm, Python-сервер), яка каже ядру: «Я чекаю на порту 3000».

Логіка: Це стан «пасивного очікування». Ядро ігнорує будь-які пакети з даними (Payload), бо з'єднання ще не встановлено.

На що чекає: Тільки на пакет із прапорцем SYN (запит на початок рукостискання).

Захист: Якщо надіслати дані серверу в стані LISTEN без попереднього SYN, ядро просто відповіде RST (Reset), розриваючи зв'язок, щоб не навантажувати процесор обробкою сміття.



                                        SYN_SENT: Ядро чекає лише на SYN-ACK. Якщо прийде пакет із даними без цього
                                        прапорця, ядро його відкине

                                        ESTABLISHED: З'єднання "активне". Тільки в цьому стані ядро дозволяє запис даних у буфери та передачу їх програмі.

                                        TIME_WAIT: З'єднання фактично закрите, але ядро тримає запис у таблиці ще деякий час (зазвичай 2 хвилини), щоб "доловити" запізнілі пакети з мережі й не віддати їх новому сокету з таким самим портом.



                           2. Sequence Number: На якому номері байта ми зараз зупинилися при відправці

                           3. Acknowledgment Number: Який номер байта ми чекаємо від сервера.

                           4. Window Size: Скільки вільного місця лишилося в нашому буфері (щоб сервер не закидав нас даними занадто швидко).

                           5. Таймери: Наприклад, таймер «очікування підтвердження». Якщо він спливе, а ACK не прийде, ядро само візьме копію пакета і відправить знову.

                           6. Буфери (Send/Receive Buffers): Тут ядро зберігає копії всіх пакетів, які ще не були підтверджені, щоб мати змогу їх переслати.




                           Створення сокета:
                                 1. ОС створює запис (сокет) у відповідній таблиці (TCP Table або UDP Table)


Видача порту: ОС виділяє вільний Source Port і записує його в цей рядок таблиці поруч із назвою програми (її Process ID).

Формування пакета: Коли програма каже «відправ ось ці дані», ОС бере дані, додає до них TCP-заголовок (якщо був обраний TCP), де вписує:

Source Port (той, що вона щойно виділила).

Destination Port (куди шлемо — наприклад, 443 для сайту).

Спуск на рівень нижче: Потім ОС «обгортає» цей TCP-пакет в IP-заголовок, додає IP-адреси й виштовхує пакет у мережеву карту
                                 , ОС видає їй числовий індекатор, який записує у поле
                                    Source Port заголовка пакету-запиту й додає ще одне поле відповідностей (порт  (ось така програма робила запит за ось таким портом




                                 2. Далі операційна система продовжує обробляти пакети-відповіді й звіряти поле
                                    Source Port зі своєю таблицею відповідностей й

                                       ◦ Якщо пакет має TCP протокол групує порцію й вкидає її в пам'ять програми з відповідним портом
                                         (наприклад вкладці браузера)

                                       ◦ Якщо пакет має UDP протокол віддає його відразу програмі з відпо відним портом
                                         (Telegram)


                                          ——————————————————————————————————————————————————————————————————————————————






Source Port (Клієнт): Число, яке ОС присвоює кожному окремому запиту (вкладці, програмі). Потрібен, щоб повернути дані в те саме "вікно", з якого вони були запитані.

Destination Port (Сервер): Число, яке серверна програма "забронювала" за собою. Потрібен, щоб запити з усього світу потрапляли саме в логіку сервера, а не просто в порожнечу.
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
             IP — це маршрутизація між залізом (hardware), Port — для маршрутизації між софтом (software)
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————



——————
 2. Sequence Number (32 біти) — Порядковий номер
——————

Оскільки TCP ріже дані на шматки, він нумерує кожен байт.

Це дозволяє отримувачу зібрати «пазл» у правильному порядку, навіть якщо шматки прийшли хаотично. Без цього поля твій лист перетворився б на набір випадкових літер.




——————
 3. Acknowledgment Number (32 біти) — Підтвердження
——————

Тут отримувач пише: «Я отримав усе до байта №1000, наступним чекаю №1001».

Саме це поле реалізує той самий принцип «МОВЧАННЯ — ЦЕ ПОМИЛКА». Якщо відправник не отримає цей номер, він буде шпетити пакети заново.

——————
 4. Data Offset (4 біти) — Довжина TCP хедера
——————

Аналог IHL в IP-хедері. Він каже комп’ютеру: «Службова інфа TCP займає ось стільки байтів, далі йдуть реальні дані (твій текст чи картинка)».


——————
 5. Flags (Прапорці — 9 бітів)
——————

Це «перемикачі», які керують станом з'єднання. Найвідоміші:

SYN (Synchronize): «Привіт, давай встановимо зв'язок?»

ACK (Acknowledgment): «Посилку отримав, усе чітко».

FIN (Finish): «Я закінчив передачу, давай прощатися».

RST (Reset): «Все зламалося, обриваємо зв'язок негайно!»

——————
 6. Window Size (16 бітів) — Розмір вікна
——————

Це поле для контролю потоку. Отримувач каже: «Братан, не шли так швидко, у мене в пам'яті залишилося місця лише на 5000 байтів».

Це не дає швидкому серверу «затопити» даними слабкий смартфон.

——————
 7. Checksum (16 бітів) — Контрольна сума
——————

Математичний відбиток усього хедера і даних.

Якщо під час польоту пакету через роутери хоча б один біт перетворився з 0 на 1 — сума не зійдеться. TCP побачить це і мовчки викине пакет у смітник, змушуючи відправника надіслати його копію.






——————————————————————————————————————————————  TCP Three-way Handshake  ———————————————————————————————————————————————

             Будь-яка передача даних через HTTP (веб-запити) або SMTP (пошта) відбувається у два етапи:


 1. Встановлення з'єднання (Connection Establishment):

        Перш ніж почати обмін специфічними даними (JSON або листами), протокол TCP виконує процедуру Three-way Handshake
        (тристороннє рукостискання)

        Це створює канал зв'язку між IP-адресою клієнта та IP-адресою сервера


 2. Передача даних: Тільки після підтвердження стабільного з'єднання через TCP, починається робота HTTP чи SMTP
    протоколів:

       ◦ В межах встановленого TCP-з'єднання браузер передає дані за HTTP протоколом

       ◦ В межах встановленого TCP-з'єднання поштовий клієнт (Nodemailer) передає дані по SMTP протоколом






 В мережі завжди є дві ролі: Сервер (той, хто чекає) та Клієнт (той, хто ініціює)

  Логіка Сервера (Отримувач)
——————————————————————————————————

  Сервер не знає, коли ми вирішимо зайти на сайт, тому він має бути в режимі осікувння усесь час

   1. Стан LISTEN (Очікування)


Програма (наприклад, твій локальний сервер у WebStorm) каже ядру ОС: «Я чекаю на порту 3000». Ядро створює запис у TCP Table зі статусом LISTEN.

Дія Ядра: Воно буквально «фільтрує» вхідний трафік. Якщо на порт 3000 прилетить пакет із даними (Payload), ядро його відкине.

На що чекаємо: Ядро реагує тільки на пакет, де піднятий прапорець SYN (запит на початок рукостискання).

Початок Handshake (Перехід у SYN_RECEIVED):
Як тільки ядро бачить SYN на порту, який стоїть у LISTEN, воно «прокидається».
Воно не віддає цей пакет програмі, а саме відповідає SYN-ACK і змінює статус цього конкретного з'єднання в таблиці
на SYN_RECEIVED.





Логіка Клієнта (Відправник)
Клієнт (наприклад, твій браузер Chrome) — це агресор, він ініціює контакт.

Створення сокета:
Браузер просить ядро: «Мені треба з'єднатися з сервером 127.0.0.1 на порту 3000».

Стан SYN_SENT (Перший крок Handshake):
Ядро клієнта відправляє той самий пакет SYN. У цей момент у TCP Table клієнта сокет переходить у стан SYN_SENT.

Чому це важливо: Клієнт тепер «затамував подих». Він ігноруватиме будь-які інші пакети, крім відповіді SYN-ACK від сервера. Це захист: ядро знає, що ми в процесі «знайомства», і не пустить ніякі сторонні дані всередину, поки не завершиться Handshake.





                       Три технічні сигнали, якими обмінюються комп'ютери для синхронізації
                       ————————————————————————————————————————————————————————————————————







 1. SYN (Synchronize)
—————————————————————

   ◦ Клієнт відправляє серверу пакет з прапорцем SYN

Що відбувається: Клієнт передає серверу свій Sequence Number (випадкове число, з якого почнеться відлік байтів).

Нащо це: Щоб сервер знав, як правильно пронумерувати та зібрати дані, які прийдуть пізніше.

2. SYN-ACK (Synchronize-Acknowledgment)
Сервер отримує SYN і відповідає пакетом з двома прапорцями — SYN та ACK.

Що відбувається: * ACK: Сервер підтверджує, що отримав номер від клієнта (додає до нього +1).

SYN: Сервер передає клієнту свій власний номер послідовності.

Нащо це: Щоб клієнт теж знав, як збирати дані, що прийдуть від сервера.

3. ACK (Acknowledgment)
Клієнт отримує відповідь і відправляє фінальний пакет ACK.

Що відбувається: Клієнт підтверджує, що отримав номер сервера (також додає +1).

Нащо це: Це фінальний сигнал для сервера, що обидва канали зв'язку (туди і назад) перевірені та працюють.


ПІДСУМОК:

   —> TCP — це первинний протокол, який виконує встановлення зв'язку між двома IP-адресами до початку будь-якого обміну
      даними

   —> ПОРЯДОК ДІЙ: TCP завжди спрацьовує першим. Тільки після того, як він створив стабільний коридор між IP-адресами,
      через нього починають текти дані прикладних протоколів (HTTP, SMTP)

   —> Процедура (Handshake): Встановлення з'єднання відбувається через три етапи (SYN → SYN-ACK → ACK), що гарантує готовність обох сторін до прийому та передачі.

Відповідальність: TCP відповідає за цілісність (щоб дані не загубилися) та черговість (щоб дані прийшли у правильному порядку).
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————







                                                        SMTP
                                                      ‾‾‾‾‾‾‾‾
                         (Simple Mail Transfer Protocol) — протокол передачі поштових повідомлень


 Якщо HTTP — це протокол передачі гіпертексту (сайтів, JSON-даних, зображень), то SMTP — це протокол передачі поштових
 повідомлень.

 SMTP описує не тільки те, як має виглядати лист, а й процедуру діалогу між двома комп'ютерами


         HTTP-сесія (Браузер <—> Наш сервер)
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
  Коли користувач натискає кнопку у твоєму React-додатку:

   —> ХТО З'ЄДНУЄТЬСЯ: Браузер (Chrome/Safari)

   —> З ЧИМ: З нашим Node.js сервером (Express).

ПРОТОКОЛ З: HTTP.

Результат: Твій сервер отримав email користувача в req.body.

————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————


 2. SMTP-сесія — це з'єднання з поштовим сервером (Mail Server)

 . SMTP-сесія (Наш сервер <-> Поштовий сервер)
Тепер твоєму Node.js серверу треба відправити реальний лист. Він "йде" в інтернет:

Хто з'єднується: Твій Node.js сервер (через бібліотеку Nodemailer).

З чим: З поштовим сервером (наприклад, smtp.gmail.com).

Протокол: SMTP.

Результат: Поштовий сервер Google прийняв лист і пообіцяв доставити його отримувачу.

SMTP — це текстовий протокол, що працює за принципом "Команда — Відповідь".

Коли твій сервер хоче відправити лист, він буквально "розмовляє" з сервером Google. Це виглядає так:

Зв'язок: Твій сервер стукає в порт 465 або 587.

Привітання: Сервери представляються один одному.

Перевірка: Твій сервер передає логін/пароль (App Password).

Конверт: Твій сервер каже: MAIL FROM: <me@gmail.com> та RCPT TO: <user@mail.com>.

Вміст: Командою DATA твій сервер передає весь текст листа.

Прощання: Командою QUIT сесія закривається.

3. Це протокол передачі чого?
Це протокол передачі MIME-повідомлень.
Лист — це не просто рядок тексту. Це складна структура, де є:

Заголовки (Хто, кому, дата, тема).

Тіло (Текст або HTML-код).

Вкладення (Картинки, PDF).

SMTP бере цей великий текстовий блок (MIME) і гарантує, що він доїде від одного сервера до іншого без помилок.

Підсумок
Чи це як HTTP? Так, це такий самий прикладний рівень мережі.

Це протокол передачі даних? Так, але специфічних даних — електронної пошти.

Це протокол встановлення зв'язку? Так, він визначає черговість кроків (спочатку привітайся, потім авторизуйся, потім давай дані).
















 */