import { setupListeners } from '@reduxjs/toolkit/query';
import { configureStore, combineReducers } from '@reduxjs/toolkit';
import { baseApi } from '@/shared/api/baseApi.js';
import { authReducer } from '@/features/auth';

const appReducer = combineReducers({
    auth: authReducer,
    [baseApi.reducerPath]: baseApi.reducer,
})

export const store = configureStore({
   reducer: appReducer,
   middleware: (getDefaultMiddleware) =>
       getDefaultMiddleware().concat(baseApi.middleware)
})

setupListeners(store.dispatch);

/*——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

 1. При запуску додатка ініціалізується стор: Викликається функція configureStore, в яку передається об'єкт конфігурації
    з полями reducer та middleware.

 2. Поле reducer приймає головний редьюсер: Це поле очікує одну головну функцію-редьюсер.

 3. Є два варіанти, як передати туди редьюсери:

     ◦ Варіант А (Автоматичний): Передати в поле reducer звичайний об'єкт із полями кастомних редьюсерів
       (наприклад, { auth: authReducer, hotels: hotelsReducer }).

       Тоді під капотом configureStore сам викличе combineReducers, передасть туди цей об'єкт, і ця функція сконструює
       та поверне головний редьюсер.


     ◦ Варіант Б (Ручний): Зробити це самостійно за межами configureStore: викликати combineReducers, передати туди той
        самий об'єкт із полями кастомних редьюсерів.

        combineReducers зробить те ж саме — скомбінує їх в один великий редьюсер (який ми назвали appReducer), і вже цей
        скомбінований редьюсер ми передамо в поле reducer конфігурації стору.


 4. Поява нової задачі: Далі нам треба, щоб за однієї умови (при логауті) редьюсер змінював би весь стейт повністю.

    Але для цього не підходять наші кастомні слайсові редьюсери (як authReducer чи hotelsReducer), тому що кожен із них
    ізольований і бачить лише свій маленький шматочок пам'яті, а доступу до сусідніх полів чи до кешу RTK Query вони
    фізично не мають



 5. Як влаштований рух екшену під капотом: Як тільки диспатчиться будь-який action, Стор запускає його в систему.
    Спочатку цей екшен ловлять і обробляють мідлвари (middlewares), а вже потім він передається на розрахунок у поле
    reducer — тобто нашому головному редьюсеру.


 6. Робота стандартного головного редьюсера: За звичайних умов головний редьюсер (appReducer) по черзі викликає всі
    кастомні слайсові редьюсери, з яких він створений, й передає в них щойно тотриманий action та відповідний шматочок
    стейту:


              const appReducer = (globalState = {}, action) => {
                // 1. Створює новий порожній об'єкт для майбутнього стейту
                const nextGlobalState = {};

                // 2. Викликає authReducer й передає йому ТІЛЬКИ його слайс й action, який тільки що прийшов
                nextGlobalState.auth = authReducer(globalState.auth, action);

                // 3. Викликає hotelsReducer й передаємо йому ТІЛЬКИ його слайс і той самий action
                nextGlobalState.hotels = hotelsReducer(globalState.hotels, action);

                // 4. Повертає зібраний докупи новий глобальний стейт
                return nextGlobalState;
              };


    Кастомні редьюсери перевіряють action.type через свої case або матчери та вносять зміни кожен у свій слайс
    глобального стану, який їм передали та повертають його.

    Після виуоику всіх кастомних редючерів, головний редючер повертає наново сформований стор, який тепер є оригінальним стором.



                Логіка ініціалізації стору (виклик configureStore при старті додатка)


    При старті додатка стор викликає головний редьюсер і передає туди state як undefined (і системний екшен
    ініціалізації @@INIT).

     У гловного редюсера є запобіжник: const appReducer = (globalState = {}, action) => ...

     globalState = {} необхідний оскільки далі голвний редюсер починає виклик кастомних редюсерів, передаючи їм як
     аргумент конкретне поле глобального стану й якщо наш стан залишиться undefined виникне системна помилка.

                                                         ↓
           nextGlobalState.auth = authReducer(globalState.auth, action);


       а з запобіжником: зверненя до поля об'єкта якого в ньому не існує повретає undefined тож наш кастомний редюсер
       викликається з аргументами: authReducer(undefined, action)


       Логіка в кастомних редюсерах: Ось тут й закінчується цей довгий ланцюжок:

        Будь-який редьюсер (включаючи головний) — це чиста JavaScript-функція, яка працює за строгою математичною
        формулою:


                        головний редюсер:

                         function(state = {}, action) {
                           ...
                           return newState
                         }



                         кастомний редюсер:

                         function(state = initiateState, action) {

                           switch(action.type) {
                             case '.../fulfilled':
                               return {
                                 ...state,
                                 updated property: value
                               }

                             default: return state;
                         }


Як ми бачимо у кастомного редюсера є також запобіжник  state = initiateState й оскільки він був викликаний з аругмнтам




          combineReducers бере цей undefined й

У JavaScript кожен редьюсер слайсу за замовчуванням оголошений так: const authReducer = (state = initialState, action) => { ... }.

Оскільки state === undefined, JavaScript автоматично ігнорує поточний стейт і бере initialState.

І ось фінал: authReducer просто повертає свій чистий initialState (наприклад, { accessToken: null, user: null }).

Йому взагалі плювати, який там тип екшену (auth/logout чи будь-який інший)! Самого факту того, що йому на вхід прийшов undefined, достатньо, щоб він сліпо повернув свій початковий стан.





 8. Логіка створення нашої обгортки (rootReducer):

    Оскільки будь-який редьюсер (включаючи головний) — це чиста JavaScript-функція, яка працює за строгою математичною
    формулою:


                         function(state, action) {
                           ...
                           return newState
                         }


             ◦ Вхід: Вона приймає state (поточний стан) та action

             ◦ Вихід: Вона зобов'язана повернути новий об'єкт стану (newState)


    Ми можемо створити навколо нього власний редюсер-обгортку (rootReducer). Він перехоплює абсолютно всі екшени та
    поточний стан ДО того, як вони потраплять всередину головного редюсера (appReducer).


 9. Суперсила обгортки: Оскільки ця обгортка стоїть на самому верху і не прив'язана до жодного конкретного слайсу,
    вона бачить і приймає весь глобальний об'єкт state цілком.

    Це дає їй повне право модифікувати або повністю перезаписувати весь цей об'єкт стану перед тим, як передати його
    далі вглиб системи. Чим ми і користуємося для реалізації логауту.



(Фінал: Механіка логауту)

 9. Перевірка в обгортці: Тому, коли прилітає екшен логауту, наш редьюсер-обгортка (rootReducer) отримує його і робить
    перевірку: if (action.type === logoutAction.type).

    Він дивиться, чи збігається тип екшену, який він щойно отримав як аргумент, з типом екшену логауту.


 10. Скидання в undefined: Якщо типи збігаються, обгортка робить команду: state = undefined;.

     Чому це легально (Перевикористання логіки ініціалізації): Це абсолютно легальний трюк, тому що саме так Redux працює
     при першому завантаженні сторінки.



     Як редьюсери реагують на undefined: Оскільки в JavaScript для аргументів редьюсерів за замовчуванням прописано
     дефолтне значення (state = initialState, action), то отримавши undefined, кожен кастомний редьюсер автоматично
     ініціалізується з нуля і повертає свій initialState.


     Поведінка RTK Query (baseApi.reducer): Отримавши undefined, він так само скидає всю свою складну внутрішню
     архітектуру і повертає чистий дефолтний стан: його внутрішні поля queries, subscriptions, mutations стають
     порожніми об'єктами {}.



Фінал ланцюжка: Знаючи цю внутрішню кухню, ми її перевикористовуємо для логауту. Нам потрібно, щоб весь глобальний стан
скинувся до дефолтних значень (initialState).

Ми штучно підсовуємо undefined нашому головному скомбінованому редьюсеру (appReducer), і система синхронно робить
Soft Reset (м'яке перезавантаження пам'яті).



🏁 Результат такого коду:
Після виконання return appReducer(undefined, action):

 - Весь кеш RTK Query зникає.

 - Усі підписки анулюються.

 - authSlice через extraReducers отримує undefined, підставляє свій initialState, але оскільки тип екшену 'auth/logout',
   він тут же затирає токен у null.

React бачить порожній токен, закриває skip на хуках, і жоден фантомний запит у мережу більше не летить.


*/