import dotenv from 'dotenv';

/*———————————————————————————————————————————————————— ↓ ↓ ↓ ———————————————————————————————————————————————————————————
 dotenv — це бібліотека, яка зчитує файл .env
  —> й завантажує всі змінні з цього файлу у пам’ять запущеної серверної програми (у process.env)
  —> ТОБТО в середовище поточного Node-процесу, який запускається командою npm run start або node server.js
——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————*/

import app from './app.js';

dotenv.config();

/*———————————————————————————————————————————————————— ↓ ↓ ↓ ———————————————————————————————————————————————————————————
 ДАЄ Node.js КОМАНДУ:

         1. Прочитай файл .env у кореневій директорії проєкту
         2. Знайти всі пари КЛЮЧ=значення
         3. Завантаж їх у process.env — це глобальний об’єкт, який існує в Node.js під час виконання серверної програми
            (тобто це пам'ять запущеної серверної програми — Node-процесу)
            ↓ ↓ ↓
         Тепер ці змінні доступні в усьому коді через process.env.JWT_SECRET
——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————*/

const PORT = process.env.PORT || 3000;

app.listen(PORT, () => {
    console.log(`Server is running on http://localhost:${PORT}`);
});
