import { useMemo } from 'react'

function slowFunction(num) {   // Штучно сповільнена функція — її мета імітувати довге обчислення
    let sum = 0;

    console.log('→ Calculating...')

    for (let i = 1; i < 100000; i++) {
        sum += i;
    }
    return Math.floor(sum/1000000000) * num;  // sum = 4
}


export default function ExpensiveComponent({count}) {
    console.log('Rendering ExpensiveComponent');

    const memoizedResult = useMemo(() => {
        return slowFunction(count)
    }, [count]);

    return (
        <div className='expensive-component'>
            <h2>Expensive Component</h2>
            <div>Result: {memoizedResult}</div>
        </div>
    )
}


/*‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 ExpensiveComponent — це приклад компонента, який є важким для повторного рендеру (через складну розмітку or обчислення)
 Цей компонент ми не хочемо перемальовувати без потреби

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 (1) const memoizedResult —→  створюємо змінну, яка збереже мемоізоване значення — результат функції slowFunction(count)


 (2) useMemo(() => { ... }, [count])  —→  useMemo — це хук, який приймає два аргументи:

       АРГУМЕНТ 1: () => { return slowFunction(count) }

            – Це функція, яка повертає результат виконання повільної або складної функції
            – Вона повертає значення, яке потрібно запам’ятати (мемоізувати)
            – React буде викликати цю функцію тільки якщо залежності змінились

       АРГУМЕНТ 2: [count]

            – Це масив залежностей
            – Якщо count не змінився з попереднього рендера → функція не виконується
            – Якщо count змінився → React виконає функцію знову і оновить memoizedResult


 ЯК ПРАЦЮЄ REACT ПРИ КОЖНОМУ РЕНДЕРІ:

   Крок	      Що перевіряється	                         Дія
   ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
    1	    Чи змінився count у [count]?	           Якщо ні → повертає старий memoizedResult
    2	    Якщо так, викликає slowFunction(count)	   Зберігає новий результат у memoizedResult


 ПІДСУМОК:
    ◦ useMemo виконує функцію лише коли змінився count

    ◦ Зберігає результат у memoizedResult

    ◦ Уникає повторного виконання повільної або складної функції

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾*/



