import { useState, useCallback } from 'react';

import CounterControls from './CounterControls';
import ExpensiveComponent from './ExpensiveComponent';
import RegularComponent from './RegularComponent';

export default function MemoExample() {
    const [count, setCount] = useState(0);
    const [anotherState, setAnotherState] = useState(false);

    const increment = useCallback(() => setCount(prev => prev + 1), []);
    const decrement = useCallback(() => setCount(prev => prev - 1), []);

    return (
        <>
            <CounterControls
                count={count}
                increment={increment}
                decrement={decrement}
            />
            <button onClick={() => setAnotherState(prev => !prev)}>Toggle another state</button>
            <ExpensiveComponent count={count} />
            <RegularComponent anotherState={anotherState} />
        </>
    )
}


                                                                                                                      /*
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 setCount(count + 1)  —>  МОЖЕ ПРАЦЮВАТИ НЕКОРЕКТНО

      1. const [count, setCount] = useState(0);

          1.1  Коли React рендерить компонент, він викликає useState() й зберігає значення, яке цей хук повертає,
               в змінну count

          1.2  count — це знімок стану, який актуальний лише для поточного рендеру


      2. Якщо далі в компоненті ми маємо функцію, яка використовує count:

          2.1  При ініціалізації ця функція замикає значення count — тобто запам'ятовує його

          2.2  Потім коли я функція викликається:

                ◦ Вона не звертається до актуального значення count у state,

                ◦ Функція використовує значення, яке було збережене (замкнене) під час її інііалізації


      3. Цей нюанс не завжди помітно, оскільки при кожному setCount:

          3.1  React викликає новий рендер

          3.2  useState() повертає оновлене значення, яке знову зберігається у змінну count

          3.3  Функції, які не обгорнуті в useCallback, перестворюються: заново ініціалізуються й замикають вже
               оновлений count

                         ↓ ↓ ↓

          Тож створюється ілюзія, що функція завжди працює з актуальним значенням count зі state, хоча насправді count
          підтримує свою актуальність лише завдяки постійному оновленню через ререндер



                               МОМЕНТИ КОЛИ МИ БАЧИМО НЕ АКТУАЛЬНІСТЬ ЗМІННОЇ COUNT:

 1. Якщо кілька разів звертаємося до count всередині однієї функції  —>  функція кожного разу використовує те саме
    збережене значення count, яке вона запам’ятала під час ініціалізації


    function MyComponent() {
      const [count, setCount] = useState(0);

      function increment() {
        setCount(count + 1)      —>  1  (бо count = 0)
        setCount(count + 1)      —>  1  (знову використовується старий count = 0)
      }

      return (
        <div>
          <p>Count: {count}</p>
          <button onClick={increment}>Increment</button>
        </div>
      );
    }

       ↓ ↓ ↓

     — Бо React не оновлює стан одразу після кожного виклику setCount

     — Він пакує (batch) кілька викликів setState, які відбуваються одночасно (в одному обробнику події)

     — Через це React не виконує повторні ререндери після кожного виклику setCount, а виконує один ререндер після
       завершення всіх викликів setState у поточному циклі одій

‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 2. Якщо функція, яка використовує count:

    2.1 Огорнута в useCallback з порожнім масивом залежностей

        import React, { useState, useCallback } from 'react';

        function Component() {
          const [count, setCount] = useState(0);

          const increment = useCallback(() => {
            setCount(count + 1);                  // завжди використовує застаріле count
          }, []);                                 // залежності пусті — функція створюється один раз

          return (
           <>
             <p>{count}</p>
             <button onClick={increment}>Increment</button>
           </>
          )
        }

       ↓ ↓ ↓

       Завдяки використанню useCallback з порожнім масивом залежностей, функція increment ініціалізується лише один
       раз — під час першого рендеру

       При наступних рендерах компонента вона не перестворюється — React повертає ту ж саму збережену функцію, яка була
       створена раніше

       Це означає, що всі змінні, на які ця функція посилається (count) — не оновлюються
       Вони були замкненні (запам'ятовані) функцією у момент її створення


       Тобто при виклику increment, вона не звертається до актуального значення count, а використовує збережене під час
       своєї першої ініціалізації (скоріше за все вже не актуальне)

       Як наслідок, increment завжди працює зі старим count, якщо ми не передали його в список залежностей


    2.2 Виконується через setTimeout, який знаходиться в useEffect з порожнім масивом залежностей

        ЦЕ ОКРЕМИЙ СПЕЦИФІЧНИЙ КЕЙС — коли ми:

           ◦ Використовуємо useEffect з порожнім масивом залежностей []  —>  він запускається лише один раз
             (при першому рендері)

           ◦ І всередині useEffect викликаємо setTimeout

           ◦ І всередині цієї відкладеної функції setTimeout звертаємось до змінних зі state

         ПРОБЛЕМА:

             Змінні зі state у такому випадку заморожуються на момент створення ефекту — React не перестворює ефект
             при оновленні state, бо список залежностей порожній

         НАСЛІДОК:

             Коли спрацює setTimeout, він можливо буде використовуватити неактуальне значення count

          БО:

             1. setTimeout виконується через деякий час (наприклад, через 3 секунди)

             2. Й якщо за ці 3 секунди count вже змінився (осовився state —> ререндер), то:

                 2.1  setTimeout не побачить ці зміни, бо замикає старе значення count

                 2.2  Це називається заморожене значення (stale closure).

                 2.3  В результаті, колбек setTimeout працює зі застарілим count, а не з актуальним


‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

 setCount(prev => prev + 1)  —>  ЗАВЖДИ ПРАЦЮЄ КОРЕКТНО

   ◦ Тут ми звертаємося до властивості count в state напряму

   ◦ React гарантовано передає актуальне значення count як prevState у момент виклику setCount

   ◦ Це — надійний спосіб оновити значення, навіть якщо функція була створена раніше й count уже змінився кілька разів



 ВИКОРИСТОВУЙ prevState КОЛИ:

  1. Є кілька викликів setState підряд у функції

  2. Функція огорнута в useCallback з порожнім масивом залежностей (використовується для передачі функції як пропс)

  3. Функція виконується з затримкою (setTimeout, setInterval)

                   ↓ ↓ ↓

  prev — це динамічне значення, яке використовують у функціях

  count — змінна лише для читання, актуальна на момент рендеру  —>  ВИКОРИСТОВУЙ ЇЇ У JSX РОЗМІТЦІ


                                                                                                                      */

