import { Routes, Route, Navigate } from 'react-router';  //  це компоненти React Router, які відповідають за навігацію в додатку

// Routes — контейнер для маршрутів  —>  перевіряє, який шлях (URL) активний, і рендерить відповідний <Route>
// Route — опис окремого маршруту  —>  вказує: який шлях → який компонент

import Layout from './components/Layout';
import Todo from './pages/todo';
import About from './pages/about';
import Contacts from './pages/contacts';
import Posts from './pages/posts';
import PostDetails from './pages/post-details';

// import NotFound from './pages/404';


function App() {
  return (
    <>
        <Routes>
            <Route path='/' element={<Layout />}>
                <Route index element={<Todo />}/>
                <Route path='about' element={<About />}/>
                <Route path='contacts' element={<Contacts />}/>
                <Route path='posts'>
                    <Route index element={<Posts />}/>
                    <Route path=':id' element={<PostDetails />}/>
                </Route>
                <Route path='*' element={<Navigate to='/'/>}/>
            </Route>
            {/*<Route path='*' element={<NotFound />}/>*/}
        </Routes>
    </>
  );
}

export default App;


/*——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

                                                        Navigate
                                                      ‾‾‾‾‾‾‾‾‾‾‾‾
                                    компонент з React Router для програмної навігації


     ◦ Програмна навігація — це керований перехід між сторінками, без кліку користувача
        —> через функцію navigate() або компонент <Navigate />

      ◦ Звичайна навігація — це перехід за посиланням, коли користувач сам натискає
        на <Link> або <NavLink> і переходить на інший маршрут



 ПРАЦЮЄ ЯК РЕДИРЕКТ, АЛЕ БЕЗ ПЕРЕЗАВАНТАЖЕННЯ СТОРІНКИ: автоматично перенаправляє користувача на інший маршрут (сторінку)

 КОЛИ ВИКОРИСТОВУЮТЬ: Щоб редиректити користувача автоматично, НАПРИКЛАД:

‾‾‾‾‾‾
   1. ПІСЛЯ ЛОГІНУ АБО ЛОГАУТУ

          НАВІЩО: Після успішної авторизації або виходу з облікового запису потрібно перенаправити користувача на іншу
                  сторінку

          ТИПОВА СИТУАЦІЯ:

               ◦ ПІСЛЯ ЛОГІНУ: Перенаправляємо на профіль або головну сторінку

                    Після введення правильних даних користувач вже авторизований, тому немає сенсу залишати його на
                    сторінці логіну  —>  Перенаправляємо його на іншу сторінку, наприклад, /profile або /home


               ◦ ПІСЛЯ ЛОГАУТУ: Перенаправляємо на головну або сторінку логіну


          ПРИКЛАД:
                    if (isLoggedIn) {
                      return <Navigate to='/profile' replace />;
                    }

‾‾‾‾‾‾

   2. ЯКЩО КОРИСТУВАЧ НЕАВТОРИЗОВАНИЙ

          НАВІЩО: Заборонити доступ до приватної сторінки (наприклад, /profile) і автоматично перенаправити на /login

          ТИПОВА СИТУАЦІЯ:

               ◦ Компонент-огортка (route guard) перевіряє авторизацію   —>  PrivateRoute

               ◦ Якщо токену немає — редиректимо на сторінку входу

          ПРИКЛАД: return isLoggedIn ? children : <Navigate to='/login' replace />;

‾‾‾‾‾‾

   3. ЯКЩО ДОСТУП ДО ПЕВНОЇ СТОРІНКИ ЗАБОРОНЕНО

          НАВІЩО: Користувач авторизований, але не має прав (наприклад, звичайний юзер намагається потрапити в адмінку)

          ТИПОВА СИТУАЦІЯ:

               ◦ Реалізація системи ролей: тільки певні ролі мають доступ

               ◦ Компонент-огортка (route guard) перевіряє права доступу   —>  AdminRoute

               ◦ Перенаправляє на сторінку з повідомленням про відмову в доступі (/403 або /not-authorized)


          ПРИКЛАД:
                    if (!user.isAdmin) {
                      return <Navigate to='/not-authorized' replace />;
                    }

‾‾‾‾‾‾

   4. ЩОБ ПЕРЕАДРЕСУВАТИ ЗІ СТАРОГО URL НА НОВИЙ

          НАВІЩО: Коли адреса сторінки (URL) змінилася, використовують редирект, щоб старі посилання
          (наприклад, з пошукових систем або закладок) автоматично перенаправляли на нову адресу

          Це важливо для збереження доступності та SEO


          ТИПОВА СИТУАЦІЯ:

               ◦ Користувач відкриває /old-profile, але ми автоматично переадресовуємо на нову адресу

               ◦ Зручно при оновленні маршрутизації, щоб не ламались старі посилання


          ПРИКЛАД:  <Route path="/old-profile" element={<Navigate to='/profile' replace />} />

‾‾‾‾‾‾


 ПРОПСИ КОМПОНЕНТА <Navigate />:

      1. to — URL або шлях для переходу

      2. replace — це пропс, який перезаписує поточний запис у історії браузера (на відміну від to, який додає нову
         сторінку в історію)

        Завдяки цьому користувач не зможе повернутися на попередню (захищену) сторінку через кнопку "Назад" у браузері


 ЯК ВИКОРИСТОВУЮТЬ: <Navigate /> зазвичай повертають (return()) з якогось компонента, якщо виконується умова
                    Й він автоматично перенаправляє користувача на інший маршрут



——————————————————————————————————————————————————————  ПРИКЛАД  ———————————————————————————————————————————————————————

 App.jsx
‾‾‾‾‾‾‾‾‾‾

import { Routes, Route } from 'react-router-dom';

import Home from './pages/Home';
import Login from './pages/Login';
import Profile from './pages/Profile';

import PrivateRoute from './routes/PrivateRoute';

function App() {
  return (
    <Routes>
      <Route path='/' element={<HomePage />} />           —>  Публічні маршрути
      <Route path='/login' element={<LoginPage />} />

      <Route                                              —>  ПРИВАТНИЙ МАРШРУТ
        path='/profile'
        element={
          <PrivateRoute>
            <ProfilePage />
          </PrivateRoute>
        }
      />
    </Routes>
  );
}
                       —> ПРИВАТНИЙ МАРШРУТ:

                            ◦ Цей маршрут веде на сторінку профілю користувача
                            ◦ Але — він обгорнутий у компонент PrivateRoute, який перевіряє чи користувач авторизований



 PrivateRoute.jsx
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

import { Navigate } from 'react-router-dom';


function checkAuth() {                                —>  Фейкова функція, яка імітує перевірку авторизації
  const token = localStorage.getItem('authToken');           ◦ Шукає токен у localStorage за ключем 'authToken'
  return Boolean(token);                                     ◦ Якщо токен є — повертає true, інакше — false
}

export default function PrivateRoute({ children }) {  —>  Компонент-огортка
  const isLoggedIn = checkAuth();                     —>  Перевіряє чи є токен

  return (
    isLoggedIn
      ? { children }                        —>  Якщо користувач авторизований, рендерить children  —>  <ProfilePage />
      : <Navigate to='/login' replace />;   —>  Якщо ні — редирект на сторінку логування
  )
}
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
                                      ❗  ЖОДНИХ ПЕРЕЗАВАНТАЖЕНЬ В SPA  ❗

            —>  Замість <a> використовують <Link>/<NavLink>, щоб змінювати URL без перезавантаження

            —>  У формах викликають e.preventDefault(), щоб запобігти перезавантаженню сторінки
——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————*/




